7767517
292 497
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728
Split                    splitncnn_0              1 8 1 2 3 4 5 6 7 8 9
Convolution              convrelu_0               1 1 9 10 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_1              1 4 10 11 12 13 14
Concat                   cat_0                    2 1 2 11 15 0=0
Convolution              convrelu_1               1 1 15 16 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_2              1 3 16 17 18 19
Concat                   cat_1                    3 1 3 12 17 20 0=0
Convolution              convrelu_2               1 1 20 21 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_3              1 2 21 22 23
Concat                   cat_2                    4 1 4 13 18 22 24 0=0
Convolution              convrelu_3               1 1 24 25 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_3                    5 1 5 14 19 23 25 26 0=0
Convolution              conv_7                   1 1 26 27 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_0                    1 1 27 28 0=2 1=1 2=2.000000e-01
BinaryOp                 add_1                    2 1 28 6 29 0=0
Split                    splitncnn_4              1 6 29 30 31 32 33 34 35
Convolution              convrelu_4               1 1 35 36 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_5              1 4 36 37 38 39 40
Concat                   cat_4                    2 1 30 37 41 0=0
Convolution              convrelu_5               1 1 41 42 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_6              1 3 42 43 44 45
Concat                   cat_5                    3 1 31 38 43 46 0=0
Convolution              convrelu_6               1 1 46 47 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_7              1 2 47 48 49
Concat                   cat_6                    4 1 32 39 44 48 50 0=0
Convolution              convrelu_7               1 1 50 51 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_7                    5 1 33 40 45 49 51 52 0=0
Convolution              conv_12                  1 1 52 53 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_2                    1 1 53 54 0=2 1=1 2=2.000000e-01
BinaryOp                 add_3                    2 1 54 34 55 0=0
Split                    splitncnn_8              1 6 55 56 57 58 59 60 61
Convolution              convrelu_8               1 1 61 62 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_9              1 4 62 63 64 65 66
Concat                   cat_8                    2 1 56 63 67 0=0
Convolution              convrelu_9               1 1 67 68 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_10             1 3 68 69 70 71
Concat                   cat_9                    3 1 57 64 69 72 0=0
Convolution              convrelu_10              1 1 72 73 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_11             1 2 73 74 75
Concat                   cat_10                   4 1 58 65 70 74 76 0=0
Convolution              convrelu_11              1 1 76 77 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_11                   5 1 59 66 71 75 77 78 0=0
Convolution              conv_17                  1 1 78 79 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_4                    1 1 79 80 0=2 1=1 2=2.000000e-01
BinaryOp                 add_5                    2 1 80 60 81 0=0
BinaryOp                 mul_6                    1 1 81 82 0=2 1=1 2=2.000000e-01
BinaryOp                 add_7                    2 1 82 7 83 0=0
Split                    splitncnn_12             1 7 83 84 85 86 87 88 89 90
Convolution              convrelu_12              1 1 90 91 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_13             1 4 91 92 93 94 95
Concat                   cat_12                   2 1 84 92 96 0=0
Convolution              convrelu_13              1 1 96 97 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_14             1 3 97 98 99 100
Concat                   cat_13                   3 1 85 93 98 101 0=0
Convolution              convrelu_14              1 1 101 102 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_15             1 2 102 103 104
Concat                   cat_14                   4 1 86 94 99 103 105 0=0
Convolution              convrelu_15              1 1 105 106 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_15                   5 1 87 95 100 104 106 107 0=0
Convolution              conv_22                  1 1 107 108 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_8                    1 1 108 109 0=2 1=1 2=2.000000e-01
BinaryOp                 add_9                    2 1 109 88 110 0=0
Split                    splitncnn_16             1 6 110 111 112 113 114 115 116
Convolution              convrelu_16              1 1 116 117 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_17             1 4 117 118 119 120 121
Concat                   cat_16                   2 1 111 118 122 0=0
Convolution              convrelu_17              1 1 122 123 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_18             1 3 123 124 125 126
Concat                   cat_17                   3 1 112 119 124 127 0=0
Convolution              convrelu_18              1 1 127 128 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_19             1 2 128 129 130
Concat                   cat_18                   4 1 113 120 125 129 131 0=0
Convolution              convrelu_19              1 1 131 132 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_19                   5 1 114 121 126 130 132 133 0=0
Convolution              conv_27                  1 1 133 134 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_10                   1 1 134 135 0=2 1=1 2=2.000000e-01
BinaryOp                 add_11                   2 1 135 115 136 0=0
Split                    splitncnn_20             1 6 136 137 138 139 140 141 142
Convolution              convrelu_20              1 1 142 143 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_21             1 4 143 144 145 146 147
Concat                   cat_20                   2 1 137 144 148 0=0
Convolution              convrelu_21              1 1 148 149 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_22             1 3 149 150 151 152
Concat                   cat_21                   3 1 138 145 150 153 0=0
Convolution              convrelu_22              1 1 153 154 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_23             1 2 154 155 156
Concat                   cat_22                   4 1 139 146 151 155 157 0=0
Convolution              convrelu_23              1 1 157 158 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_23                   5 1 140 147 152 156 158 159 0=0
Convolution              conv_32                  1 1 159 160 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_12                   1 1 160 161 0=2 1=1 2=2.000000e-01
BinaryOp                 add_13                   2 1 161 141 162 0=0
BinaryOp                 mul_14                   1 1 162 163 0=2 1=1 2=2.000000e-01
BinaryOp                 add_15                   2 1 163 89 164 0=0
Split                    splitncnn_24             1 7 164 165 166 167 168 169 170 171
Convolution              convrelu_24              1 1 171 172 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_25             1 4 172 173 174 175 176
Concat                   cat_24                   2 1 165 173 177 0=0
Convolution              convrelu_25              1 1 177 178 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_26             1 3 178 179 180 181
Concat                   cat_25                   3 1 166 174 179 182 0=0
Convolution              convrelu_26              1 1 182 183 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_27             1 2 183 184 185
Concat                   cat_26                   4 1 167 175 180 184 186 0=0
Convolution              convrelu_27              1 1 186 187 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_27                   5 1 168 176 181 185 187 188 0=0
Convolution              conv_37                  1 1 188 189 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_16                   1 1 189 190 0=2 1=1 2=2.000000e-01
BinaryOp                 add_17                   2 1 190 169 191 0=0
Split                    splitncnn_28             1 6 191 192 193 194 195 196 197
Convolution              convrelu_28              1 1 197 198 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_29             1 4 198 199 200 201 202
Concat                   cat_28                   2 1 192 199 203 0=0
Convolution              convrelu_29              1 1 203 204 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_30             1 3 204 205 206 207
Concat                   cat_29                   3 1 193 200 205 208 0=0
Convolution              convrelu_30              1 1 208 209 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_31             1 2 209 210 211
Concat                   cat_30                   4 1 194 201 206 210 212 0=0
Convolution              convrelu_31              1 1 212 213 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_31                   5 1 195 202 207 211 213 214 0=0
Convolution              conv_42                  1 1 214 215 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_18                   1 1 215 216 0=2 1=1 2=2.000000e-01
BinaryOp                 add_19                   2 1 216 196 217 0=0
Split                    splitncnn_32             1 6 217 218 219 220 221 222 223
Convolution              convrelu_32              1 1 223 224 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_33             1 4 224 225 226 227 228
Concat                   cat_32                   2 1 218 225 229 0=0
Convolution              convrelu_33              1 1 229 230 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_34             1 3 230 231 232 233
Concat                   cat_33                   3 1 219 226 231 234 0=0
Convolution              convrelu_34              1 1 234 235 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_35             1 2 235 236 237
Concat                   cat_34                   4 1 220 227 232 236 238 0=0
Convolution              convrelu_35              1 1 238 239 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_35                   5 1 221 228 233 237 239 240 0=0
Convolution              conv_47                  1 1 240 241 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_20                   1 1 241 242 0=2 1=1 2=2.000000e-01
BinaryOp                 add_21                   2 1 242 222 243 0=0
BinaryOp                 mul_22                   1 1 243 244 0=2 1=1 2=2.000000e-01
BinaryOp                 add_23                   2 1 244 170 245 0=0
Split                    splitncnn_36             1 7 245 246 247 248 249 250 251 252
Convolution              convrelu_36              1 1 252 253 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_37             1 4 253 254 255 256 257
Concat                   cat_36                   2 1 246 254 258 0=0
Convolution              convrelu_37              1 1 258 259 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_38             1 3 259 260 261 262
Concat                   cat_37                   3 1 247 255 260 263 0=0
Convolution              convrelu_38              1 1 263 264 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_39             1 2 264 265 266
Concat                   cat_38                   4 1 248 256 261 265 267 0=0
Convolution              convrelu_39              1 1 267 268 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_39                   5 1 249 257 262 266 268 269 0=0
Convolution              conv_52                  1 1 269 270 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_24                   1 1 270 271 0=2 1=1 2=2.000000e-01
BinaryOp                 add_25                   2 1 271 250 272 0=0
Split                    splitncnn_40             1 6 272 273 274 275 276 277 278
Convolution              convrelu_40              1 1 278 279 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_41             1 4 279 280 281 282 283
Concat                   cat_40                   2 1 273 280 284 0=0
Convolution              convrelu_41              1 1 284 285 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_42             1 3 285 286 287 288
Concat                   cat_41                   3 1 274 281 286 289 0=0
Convolution              convrelu_42              1 1 289 290 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_43             1 2 290 291 292
Concat                   cat_42                   4 1 275 282 287 291 293 0=0
Convolution              convrelu_43              1 1 293 294 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_43                   5 1 276 283 288 292 294 295 0=0
Convolution              conv_57                  1 1 295 296 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_26                   1 1 296 297 0=2 1=1 2=2.000000e-01
BinaryOp                 add_27                   2 1 297 277 298 0=0
Split                    splitncnn_44             1 6 298 299 300 301 302 303 304
Convolution              convrelu_44              1 1 304 305 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_45             1 4 305 306 307 308 309
Concat                   cat_44                   2 1 299 306 310 0=0
Convolution              convrelu_45              1 1 310 311 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_46             1 3 311 312 313 314
Concat                   cat_45                   3 1 300 307 312 315 0=0
Convolution              convrelu_46              1 1 315 316 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_47             1 2 316 317 318
Concat                   cat_46                   4 1 301 308 313 317 319 0=0
Convolution              convrelu_47              1 1 319 320 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_47                   5 1 302 309 314 318 320 321 0=0
Convolution              conv_62                  1 1 321 322 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_28                   1 1 322 323 0=2 1=1 2=2.000000e-01
BinaryOp                 add_29                   2 1 323 303 324 0=0
BinaryOp                 mul_30                   1 1 324 325 0=2 1=1 2=2.000000e-01
BinaryOp                 add_31                   2 1 325 251 326 0=0
Split                    splitncnn_48             1 7 326 327 328 329 330 331 332 333
Convolution              convrelu_48              1 1 333 334 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_49             1 4 334 335 336 337 338
Concat                   cat_48                   2 1 327 335 339 0=0
Convolution              convrelu_49              1 1 339 340 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_50             1 3 340 341 342 343
Concat                   cat_49                   3 1 328 336 341 344 0=0
Convolution              convrelu_50              1 1 344 345 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_51             1 2 345 346 347
Concat                   cat_50                   4 1 329 337 342 346 348 0=0
Convolution              convrelu_51              1 1 348 349 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_51                   5 1 330 338 343 347 349 350 0=0
Convolution              conv_67                  1 1 350 351 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_32                   1 1 351 352 0=2 1=1 2=2.000000e-01
BinaryOp                 add_33                   2 1 352 331 353 0=0
Split                    splitncnn_52             1 6 353 354 355 356 357 358 359
Convolution              convrelu_52              1 1 359 360 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_53             1 4 360 361 362 363 364
Concat                   cat_52                   2 1 354 361 365 0=0
Convolution              convrelu_53              1 1 365 366 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_54             1 3 366 367 368 369
Concat                   cat_53                   3 1 355 362 367 370 0=0
Convolution              convrelu_54              1 1 370 371 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_55             1 2 371 372 373
Concat                   cat_54                   4 1 356 363 368 372 374 0=0
Convolution              convrelu_55              1 1 374 375 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_55                   5 1 357 364 369 373 375 376 0=0
Convolution              conv_72                  1 1 376 377 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_34                   1 1 377 378 0=2 1=1 2=2.000000e-01
BinaryOp                 add_35                   2 1 378 358 379 0=0
Split                    splitncnn_56             1 6 379 380 381 382 383 384 385
Convolution              convrelu_56              1 1 385 386 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_57             1 4 386 387 388 389 390
Concat                   cat_56                   2 1 380 387 391 0=0
Convolution              convrelu_57              1 1 391 392 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_58             1 3 392 393 394 395
Concat                   cat_57                   3 1 381 388 393 396 0=0
Convolution              convrelu_58              1 1 396 397 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_59             1 2 397 398 399
Concat                   cat_58                   4 1 382 389 394 398 400 0=0
Convolution              convrelu_59              1 1 400 401 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_59                   5 1 383 390 395 399 401 402 0=0
Convolution              conv_77                  1 1 402 403 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_36                   1 1 403 404 0=2 1=1 2=2.000000e-01
BinaryOp                 add_37                   2 1 404 384 405 0=0
BinaryOp                 mul_38                   1 1 405 406 0=2 1=1 2=2.000000e-01
BinaryOp                 add_39                   2 1 406 332 407 0=0
Split                    splitncnn_60             1 7 407 408 409 410 411 412 413 414
Convolution              convrelu_60              1 1 414 415 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_61             1 4 415 416 417 418 419
Concat                   cat_60                   2 1 408 416 420 0=0
Convolution              convrelu_61              1 1 420 421 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_62             1 3 421 422 423 424
Concat                   cat_61                   3 1 409 417 422 425 0=0
Convolution              convrelu_62              1 1 425 426 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_63             1 2 426 427 428
Concat                   cat_62                   4 1 410 418 423 427 429 0=0
Convolution              convrelu_63              1 1 429 430 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_63                   5 1 411 419 424 428 430 431 0=0
Convolution              conv_82                  1 1 431 432 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_40                   1 1 432 433 0=2 1=1 2=2.000000e-01
BinaryOp                 add_41                   2 1 433 412 434 0=0
Split                    splitncnn_64             1 6 434 435 436 437 438 439 440
Convolution              convrelu_64              1 1 440 441 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_65             1 4 441 442 443 444 445
Concat                   cat_64                   2 1 435 442 446 0=0
Convolution              convrelu_65              1 1 446 447 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_66             1 3 447 448 449 450
Concat                   cat_65                   3 1 436 443 448 451 0=0
Convolution              convrelu_66              1 1 451 452 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_67             1 2 452 453 454
Concat                   cat_66                   4 1 437 444 449 453 455 0=0
Convolution              convrelu_67              1 1 455 456 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_67                   5 1 438 445 450 454 456 457 0=0
Convolution              conv_87                  1 1 457 458 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_42                   1 1 458 459 0=2 1=1 2=2.000000e-01
BinaryOp                 add_43                   2 1 459 439 460 0=0
Split                    splitncnn_68             1 6 460 461 462 463 464 465 466
Convolution              convrelu_68              1 1 466 467 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
Split                    splitncnn_69             1 4 467 468 469 470 471
Concat                   cat_68                   2 1 461 468 472 0=0
Convolution              convrelu_69              1 1 472 473 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=2
Split                    splitncnn_70             1 3 473 474 475 476
Concat                   cat_69                   3 1 462 469 474 477 0=0
Convolution              convrelu_70              1 1 477 478 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_71             1 2 478 479 480
Concat                   cat_70                   4 1 463 470 475 479 481 0=0
Convolution              convrelu_71              1 1 481 482 0=32 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080 9=2
Concat                   cat_71                   5 1 464 471 476 480 482 483 0=0
Convolution              conv_92                  1 1 483 484 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
BinaryOp                 mul_44                   1 1 484 485 0=2 1=1 2=2.000000e-01
BinaryOp                 add_45                   2 1 485 465 486 0=0
BinaryOp                 mul_46                   1 1 486 487 0=2 1=1 2=2.000000e-01
BinaryOp                 add_47                   2 1 487 413 488 0=0
Convolution              conv_93                  1 1 488 489 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_48                   2 1 8 489 490 0=0
Interp                   upsample_nearest_0       1 1 490 491 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              convrelu_72              1 1 491 492 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Interp                   upsample_nearest_1       1 1 492 493 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              convrelu_73              1 1 493 494 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Convolution              convrelu_74              1 1 494 495 0=64 1=3 -23310=1,2.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Convolution              conv_97                  1 1 495 out0 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728
