7767517
436 547
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Convolution              conv_42                  1 1 1 3 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296
Convolution              conv_41                  1 1 2 4 0=48 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=144
BinaryOp                 add_0                    2 1 3 4 5 0=0
BatchNorm                bn_4                     1 1 5 6 0=48 1=1.000000e-03
ReLU                     relu_184                 1 1 6 7
Split                    splitncnn_1              1 2 7 8 9
Convolution              conv_44                  1 1 8 10 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472
Convolution              conv_43                  1 1 9 11 0=96 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=4608
BinaryOp                 add_1                    2 1 10 11 12 0=0
BatchNorm                bn_5                     1 1 12 13 0=96 1=1.000000e-03
ReLU                     relu_185                 1 1 13 14
Split                    splitncnn_2              1 2 14 15 16
MemoryData               backbone.stage1.blocks.bottlenecks.0 0 1 17 0=1
Convolution              convrelu_0               1 1 16 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072 9=1
Split                    splitncnn_3              1 4 18 19 20 21 22
Convolution              conv_47                  1 1 21 23 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_46                  1 1 22 24 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_2                    2 1 23 24 25 0=0
BinaryOp                 add_3                    2 1 25 19 26 0=0
BatchNorm                bn_6                     1 1 26 27 0=32 1=1.000000e-03
ReLU                     relu_187                 1 1 27 28
Split                    splitncnn_4              1 3 28 29 30 31
Convolution              conv_49                  1 1 30 32 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_48                  1 1 31 33 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_4                    2 1 32 33 34 0=0
BinaryOp                 add_5                    2 1 34 29 35 0=0
BatchNorm                bn_7                     1 1 35 36 0=32 1=1.000000e-03
BinaryOp                 mul_6                    2 1 17 20 37 0=2
ReLU                     relu_188                 1 1 36 38
BinaryOp                 add_7                    2 1 37 38 39 0=0
Split                    splitncnn_5              1 4 39 40 41 42 43
MemoryData               backbone.stage1.blocks.bottlenecks.1 0 1 44 0=1
Convolution              conv_51                  1 1 42 45 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_50                  1 1 43 46 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_8                    2 1 45 46 47 0=0
BinaryOp                 add_9                    2 1 47 40 48 0=0
BatchNorm                bn_8                     1 1 48 49 0=32 1=1.000000e-03
ReLU                     relu_189                 1 1 49 50
Split                    splitncnn_6              1 3 50 51 52 53
Convolution              conv_53                  1 1 52 54 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_52                  1 1 53 55 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
BinaryOp                 add_10                   2 1 54 55 56 0=0
BinaryOp                 add_11                   2 1 56 51 57 0=0
BatchNorm                bn_9                     1 1 57 58 0=32 1=1.000000e-03
BinaryOp                 mul_12                   2 1 44 41 59 0=2
ReLU                     relu_190                 1 1 58 60
BinaryOp                 add_13                   2 1 59 60 61 0=0
Convolution              convrelu_1               1 1 15 62 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072 9=1
Concat                   cat_0                    2 1 61 62 63 0=0
Convolution              convrelu_2               1 1 63 64 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=1
Split                    splitncnn_7              1 3 64 65 66 67
Convolution              conv_57                  1 1 66 68 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888
Convolution              conv_56                  1 1 67 69 0=192 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=18432
BinaryOp                 add_14                   2 1 68 69 70 0=0
BatchNorm                bn_10                    1 1 70 71 0=192 1=1.000000e-03
ReLU                     relu_193                 1 1 71 72
Split                    splitncnn_8              1 2 72 73 74
MemoryData               backbone.stage2.blocks.bottlenecks.0 0 1 75 0=1
Convolution              convrelu_3               1 1 74 76 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Split                    splitncnn_9              1 4 76 77 78 79 80
Convolution              conv_60                  1 1 79 81 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_59                  1 1 80 82 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_15                   2 1 81 82 83 0=0
BinaryOp                 add_16                   2 1 83 77 84 0=0
BatchNorm                bn_11                    1 1 84 85 0=64 1=1.000000e-03
ReLU                     relu_195                 1 1 85 86
Split                    splitncnn_10             1 3 86 87 88 89
Convolution              conv_62                  1 1 88 90 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_61                  1 1 89 91 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_17                   2 1 90 91 92 0=0
BinaryOp                 add_18                   2 1 92 87 93 0=0
BatchNorm                bn_12                    1 1 93 94 0=64 1=1.000000e-03
BinaryOp                 mul_19                   2 1 75 78 95 0=2
ReLU                     relu_196                 1 1 94 96
BinaryOp                 add_20                   2 1 95 96 97 0=0
Split                    splitncnn_11             1 4 97 98 99 100 101
MemoryData               backbone.stage2.blocks.bottlenecks.1 0 1 102 0=1
Convolution              conv_64                  1 1 100 103 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_63                  1 1 101 104 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_21                   2 1 103 104 105 0=0
BinaryOp                 add_22                   2 1 105 98 106 0=0
BatchNorm                bn_13                    1 1 106 107 0=64 1=1.000000e-03
ReLU                     relu_197                 1 1 107 108
Split                    splitncnn_12             1 3 108 109 110 111
Convolution              conv_66                  1 1 110 112 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_65                  1 1 111 113 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_23                   2 1 112 113 114 0=0
BinaryOp                 add_24                   2 1 114 109 115 0=0
BatchNorm                bn_14                    1 1 115 116 0=64 1=1.000000e-03
BinaryOp                 mul_25                   2 1 102 99 117 0=2
ReLU                     relu_198                 1 1 116 118
BinaryOp                 add_26                   2 1 117 118 119 0=0
Split                    splitncnn_13             1 4 119 120 121 122 123
MemoryData               backbone.stage2.blocks.bottlenecks.2 0 1 124 0=1
Convolution              conv_68                  1 1 122 125 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_67                  1 1 123 126 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_27                   2 1 125 126 127 0=0
BinaryOp                 add_28                   2 1 127 120 128 0=0
BatchNorm                bn_15                    1 1 128 129 0=64 1=1.000000e-03
ReLU                     relu_199                 1 1 129 130
Split                    splitncnn_14             1 3 130 131 132 133
Convolution              conv_70                  1 1 132 134 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_69                  1 1 133 135 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_29                   2 1 134 135 136 0=0
BinaryOp                 add_30                   2 1 136 131 137 0=0
BatchNorm                bn_16                    1 1 137 138 0=64 1=1.000000e-03
BinaryOp                 mul_31                   2 1 124 121 139 0=2
ReLU                     relu_200                 1 1 138 140
BinaryOp                 add_32                   2 1 139 140 141 0=0
Convolution              convrelu_4               1 1 73 142 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Concat                   cat_1                    2 1 141 142 143 0=0
Convolution              convrelu_5               1 1 143 144 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Split                    splitncnn_15             1 4 144 145 146 147 148
Convolution              conv_74                  1 1 147 149 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=663552
Convolution              conv_73                  1 1 148 150 0=384 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=73728
BinaryOp                 add_33                   2 1 149 150 151 0=0
BatchNorm                bn_17                    1 1 151 152 0=384 1=1.000000e-03
ReLU                     relu_203                 1 1 152 153
Split                    splitncnn_16             1 2 153 154 155
MemoryData               backbone.stage3.blocks.bottlenecks.0 0 1 156 0=1
Convolution              convrelu_6               1 1 155 157 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Split                    splitncnn_17             1 4 157 158 159 160 161
Convolution              conv_77                  1 1 160 162 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_76                  1 1 161 163 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_34                   2 1 162 163 164 0=0
BinaryOp                 add_35                   2 1 164 158 165 0=0
BatchNorm                bn_18                    1 1 165 166 0=96 1=1.000000e-03
ReLU                     relu_205                 1 1 166 167
Split                    splitncnn_18             1 3 167 168 169 170
Convolution              conv_79                  1 1 169 171 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_78                  1 1 170 172 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_36                   2 1 171 172 173 0=0
BinaryOp                 add_37                   2 1 173 168 174 0=0
BatchNorm                bn_19                    1 1 174 175 0=96 1=1.000000e-03
BinaryOp                 mul_38                   2 1 156 159 176 0=2
ReLU                     relu_206                 1 1 175 177
BinaryOp                 add_39                   2 1 176 177 178 0=0
Split                    splitncnn_19             1 4 178 179 180 181 182
MemoryData               backbone.stage3.blocks.bottlenecks.1 0 1 183 0=1
Convolution              conv_81                  1 1 181 184 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_80                  1 1 182 185 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_40                   2 1 184 185 186 0=0
BinaryOp                 add_41                   2 1 186 179 187 0=0
BatchNorm                bn_20                    1 1 187 188 0=96 1=1.000000e-03
ReLU                     relu_207                 1 1 188 189
Split                    splitncnn_20             1 3 189 190 191 192
Convolution              conv_83                  1 1 191 193 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_82                  1 1 192 194 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_42                   2 1 193 194 195 0=0
BinaryOp                 add_43                   2 1 195 190 196 0=0
BatchNorm                bn_21                    1 1 196 197 0=96 1=1.000000e-03
BinaryOp                 mul_44                   2 1 183 180 198 0=2
ReLU                     relu_208                 1 1 197 199
BinaryOp                 add_45                   2 1 198 199 200 0=0
Split                    splitncnn_21             1 4 200 201 202 203 204
MemoryData               backbone.stage3.blocks.bottlenecks.2 0 1 205 0=1
Convolution              conv_85                  1 1 203 206 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_84                  1 1 204 207 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_46                   2 1 206 207 208 0=0
BinaryOp                 add_47                   2 1 208 201 209 0=0
BatchNorm                bn_22                    1 1 209 210 0=96 1=1.000000e-03
ReLU                     relu_209                 1 1 210 211
Split                    splitncnn_22             1 3 211 212 213 214
Convolution              conv_87                  1 1 213 215 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_86                  1 1 214 216 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_48                   2 1 215 216 217 0=0
BinaryOp                 add_49                   2 1 217 212 218 0=0
BatchNorm                bn_23                    1 1 218 219 0=96 1=1.000000e-03
BinaryOp                 mul_50                   2 1 205 202 220 0=2
ReLU                     relu_210                 1 1 219 221
BinaryOp                 add_51                   2 1 220 221 222 0=0
Split                    splitncnn_23             1 4 222 223 224 225 226
MemoryData               backbone.stage3.blocks.bottlenecks.3 0 1 227 0=1
Convolution              conv_89                  1 1 225 228 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_88                  1 1 226 229 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_52                   2 1 228 229 230 0=0
BinaryOp                 add_53                   2 1 230 223 231 0=0
BatchNorm                bn_24                    1 1 231 232 0=96 1=1.000000e-03
ReLU                     relu_211                 1 1 232 233
Split                    splitncnn_24             1 3 233 234 235 236
Convolution              conv_91                  1 1 235 237 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_90                  1 1 236 238 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_54                   2 1 237 238 239 0=0
BinaryOp                 add_55                   2 1 239 234 240 0=0
BatchNorm                bn_25                    1 1 240 241 0=96 1=1.000000e-03
BinaryOp                 mul_56                   2 1 227 224 242 0=2
ReLU                     relu_212                 1 1 241 243
BinaryOp                 add_57                   2 1 242 243 244 0=0
Split                    splitncnn_25             1 4 244 245 246 247 248
MemoryData               backbone.stage3.blocks.bottlenecks.4 0 1 249 0=1
Convolution              conv_93                  1 1 247 250 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_92                  1 1 248 251 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_58                   2 1 250 251 252 0=0
BinaryOp                 add_59                   2 1 252 245 253 0=0
BatchNorm                bn_26                    1 1 253 254 0=96 1=1.000000e-03
ReLU                     relu_213                 1 1 254 255
Split                    splitncnn_26             1 3 255 256 257 258
Convolution              conv_95                  1 1 257 259 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_94                  1 1 258 260 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_60                   2 1 259 260 261 0=0
BinaryOp                 add_61                   2 1 261 256 262 0=0
BatchNorm                bn_27                    1 1 262 263 0=96 1=1.000000e-03
BinaryOp                 mul_62                   2 1 249 246 264 0=2
ReLU                     relu_214                 1 1 263 265
BinaryOp                 add_63                   2 1 264 265 266 0=0
Convolution              convrelu_7               1 1 154 267 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Concat                   cat_2                    2 1 266 267 268 0=0
Convolution              convrelu_8               1 1 268 269 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=1
Split                    splitncnn_27             1 3 269 270 271 272
Convolution              conv_99                  1 1 271 273 0=768 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2654208
Convolution              conv_98                  1 1 272 274 0=768 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=294912
BinaryOp                 add_64                   2 1 273 274 275 0=0
BatchNorm                bn_28                    1 1 275 276 0=768 1=1.000000e-03
ReLU                     relu_217                 1 1 276 277
Split                    splitncnn_28             1 2 277 278 279
MemoryData               backbone.stage4.blocks.bottlenecks.0 0 1 280 0=1
Convolution              convrelu_9               1 1 279 281 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456 9=1
Split                    splitncnn_29             1 4 281 282 283 284 285
Convolution              conv_102                 1 1 284 286 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Convolution              conv_101                 1 1 285 287 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 add_65                   2 1 286 287 288 0=0
BinaryOp                 add_66                   2 1 288 282 289 0=0
BatchNorm                bn_29                    1 1 289 290 0=192 1=1.000000e-03
ReLU                     relu_219                 1 1 290 291
Split                    splitncnn_30             1 3 291 292 293 294
Convolution              conv_104                 1 1 293 295 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Convolution              conv_103                 1 1 294 296 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 add_67                   2 1 295 296 297 0=0
BinaryOp                 add_68                   2 1 297 292 298 0=0
BatchNorm                bn_30                    1 1 298 299 0=192 1=1.000000e-03
BinaryOp                 mul_69                   2 1 280 283 300 0=2
ReLU                     relu_220                 1 1 299 301
BinaryOp                 add_70                   2 1 300 301 302 0=0
Split                    splitncnn_31             1 4 302 303 304 305 306
MemoryData               backbone.stage4.blocks.bottlenecks.1 0 1 307 0=1
Convolution              conv_106                 1 1 305 308 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Convolution              conv_105                 1 1 306 309 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 add_71                   2 1 308 309 310 0=0
BinaryOp                 add_72                   2 1 310 303 311 0=0
BatchNorm                bn_31                    1 1 311 312 0=192 1=1.000000e-03
ReLU                     relu_221                 1 1 312 313
Split                    splitncnn_32             1 3 313 314 315 316
Convolution              conv_108                 1 1 315 317 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Convolution              conv_107                 1 1 316 318 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 add_73                   2 1 317 318 319 0=0
BinaryOp                 add_74                   2 1 319 314 320 0=0
BatchNorm                bn_32                    1 1 320 321 0=192 1=1.000000e-03
BinaryOp                 mul_75                   2 1 307 304 322 0=2
ReLU                     relu_222                 1 1 321 323
BinaryOp                 add_76                   2 1 322 323 324 0=0
Convolution              convrelu_10              1 1 278 325 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456 9=1
Concat                   cat_3                    2 1 324 325 326 0=0
Convolution              convrelu_11              1 1 326 327 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912 9=1
Convolution              convrelu_12              1 1 327 328 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912 9=1
Split                    splitncnn_33             1 4 328 329 330 331 332
Pooling                  maxpool2d_183            1 1 330 333 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Pooling                  maxpool2d_182            1 1 331 334 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_181            1 1 332 335 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 329 335 334 333 336 0=0
Convolution              convrelu_14              1 1 336 337 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1179648 9=1
Convolution              convrelu_15              1 1 337 338 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456 9=1
Split                    splitncnn_34             1 2 338 339 340
Deconvolution            deconv_179               1 1 340 341 0=192 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=147456
Convolution              convrelu_17              1 1 270 342 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=1
Convolution              convrelu_13              1 1 146 343 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Convolution              convrelu_16              1 1 343 344 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776 9=1
Concat                   cat_5                    3 1 341 342 344 345 0=0
Convolution              convrelu_18              1 1 345 346 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592 9=1
Split                    splitncnn_35             1 2 346 347 348
MemoryData               neck.neck1.blocks.bottlenecks.0 0 1 349 0=1
Convolution              convrelu_19              1 1 348 350 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Split                    splitncnn_36             1 4 350 351 352 353 354
Convolution              conv_120                 1 1 353 355 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_119                 1 1 354 356 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_77                   2 1 355 356 357 0=0
BinaryOp                 add_78                   2 1 357 351 358 0=0
BatchNorm                bn_33                    1 1 358 359 0=64 1=1.000000e-03
ReLU                     relu_233                 1 1 359 360
Split                    splitncnn_37             1 3 360 361 362 363
Convolution              conv_122                 1 1 362 364 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_121                 1 1 363 365 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_79                   2 1 364 365 366 0=0
BinaryOp                 add_80                   2 1 366 361 367 0=0
BatchNorm                bn_34                    1 1 367 368 0=64 1=1.000000e-03
BinaryOp                 mul_81                   2 1 349 352 369 0=2
ReLU                     relu_234                 1 1 368 370
BinaryOp                 add_82                   2 1 369 370 371 0=0
Split                    splitncnn_38             1 4 371 372 373 374 375
MemoryData               neck.neck1.blocks.bottlenecks.1 0 1 376 0=1
Convolution              conv_124                 1 1 374 377 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_123                 1 1 375 378 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_83                   2 1 377 378 379 0=0
BinaryOp                 add_84                   2 1 379 372 380 0=0
BatchNorm                bn_35                    1 1 380 381 0=64 1=1.000000e-03
ReLU                     relu_235                 1 1 381 382
Split                    splitncnn_39             1 3 382 383 384 385
Convolution              conv_126                 1 1 384 386 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_125                 1 1 385 387 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_85                   2 1 386 387 388 0=0
BinaryOp                 add_86                   2 1 388 383 389 0=0
BatchNorm                bn_36                    1 1 389 390 0=64 1=1.000000e-03
BinaryOp                 mul_87                   2 1 376 373 391 0=2
ReLU                     relu_236                 1 1 390 392
BinaryOp                 add_88                   2 1 391 392 393 0=0
Convolution              convrelu_20              1 1 347 394 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Concat                   cat_6                    2 1 393 394 395 0=0
Convolution              convrelu_22              1 1 395 396 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Convolution              convrelu_23              1 1 396 397 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Split                    splitncnn_40             1 2 397 398 399
Deconvolution            deconv_180               1 1 399 400 0=96 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=36864
Convolution              convrelu_25              1 1 145 401 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Convolution              convrelu_21              1 1 65 402 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_24              1 1 402 403 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=82944 9=1
Concat                   cat_7                    3 1 400 401 403 404 0=0
Convolution              convrelu_26              1 1 404 405 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648 9=1
Split                    splitncnn_41             1 2 405 406 407
MemoryData               neck.neck2.blocks.bottlenecks.0 0 1 408 0=1
Convolution              convrelu_27              1 1 407 409 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=1
Split                    splitncnn_42             1 4 409 410 411 412 413
Convolution              conv_136                 1 1 412 414 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Convolution              conv_135                 1 1 413 415 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
BinaryOp                 add_89                   2 1 414 415 416 0=0
BinaryOp                 add_90                   2 1 416 410 417 0=0
BatchNorm                bn_37                    1 1 417 418 0=48 1=1.000000e-03
ReLU                     relu_245                 1 1 418 419
Split                    splitncnn_43             1 3 419 420 421 422
Convolution              conv_138                 1 1 421 423 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Convolution              conv_137                 1 1 422 424 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
BinaryOp                 add_91                   2 1 423 424 425 0=0
BinaryOp                 add_92                   2 1 425 420 426 0=0
BatchNorm                bn_38                    1 1 426 427 0=48 1=1.000000e-03
BinaryOp                 mul_93                   2 1 408 411 428 0=2
ReLU                     relu_246                 1 1 427 429
BinaryOp                 add_94                   2 1 428 429 430 0=0
Split                    splitncnn_44             1 4 430 431 432 433 434
MemoryData               neck.neck2.blocks.bottlenecks.1 0 1 435 0=1
Convolution              conv_140                 1 1 433 436 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Convolution              conv_139                 1 1 434 437 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
BinaryOp                 add_95                   2 1 436 437 438 0=0
BinaryOp                 add_96                   2 1 438 431 439 0=0
BatchNorm                bn_39                    1 1 439 440 0=48 1=1.000000e-03
ReLU                     relu_247                 1 1 440 441
Split                    splitncnn_45             1 3 441 442 443 444
Convolution              conv_142                 1 1 443 445 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Convolution              conv_141                 1 1 444 446 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
BinaryOp                 add_97                   2 1 445 446 447 0=0
BinaryOp                 add_98                   2 1 447 442 448 0=0
BatchNorm                bn_40                    1 1 448 449 0=48 1=1.000000e-03
BinaryOp                 mul_99                   2 1 435 432 450 0=2
ReLU                     relu_248                 1 1 449 451
BinaryOp                 add_100                  2 1 450 451 452 0=0
Convolution              convrelu_28              1 1 406 453 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=1
Concat                   cat_8                    2 1 452 453 454 0=0
Convolution              convrelu_29              1 1 454 455 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Split                    splitncnn_46             1 2 455 456 457
Convolution              convrelu_30              1 1 457 458 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=82944 9=1
Concat                   cat_9                    2 1 458 398 459 0=0
Split                    splitncnn_47             1 2 459 460 461
MemoryData               neck.neck3.blocks.bottlenecks.0 0 1 462 0=1
Convolution              convrelu_31              1 1 461 463 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Split                    splitncnn_48             1 2 463 464 465
BinaryOp                 mul_101                  2 1 462 464 466 0=2
Convolution              convrelu_32              1 1 465 467 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_33              1 1 467 468 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_102                  2 1 466 468 469 0=0
Split                    splitncnn_49             1 2 469 470 471
MemoryData               neck.neck3.blocks.bottlenecks.1 0 1 472 0=1
BinaryOp                 mul_103                  2 1 472 470 473 0=2
Convolution              convrelu_34              1 1 471 474 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_35              1 1 474 475 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_104                  2 1 473 475 476 0=0
Convolution              convrelu_36              1 1 460 477 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Concat                   cat_10                   2 1 476 477 478 0=0
Convolution              convrelu_37              1 1 478 479 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Split                    splitncnn_50             1 2 479 480 481
Convolution              convrelu_38              1 1 481 482 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776 9=1
Concat                   cat_11                   2 1 482 339 483 0=0
Split                    splitncnn_51             1 2 483 484 485
MemoryData               neck.neck4.blocks.bottlenecks.0 0 1 486 0=1
Convolution              convrelu_39              1 1 485 487 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Split                    splitncnn_52             1 2 487 488 489
BinaryOp                 mul_105                  2 1 486 488 490 0=2
Convolution              convrelu_40              1 1 489 491 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_41              1 1 491 492 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_106                  2 1 490 492 493 0=0
Split                    splitncnn_53             1 2 493 494 495
MemoryData               neck.neck4.blocks.bottlenecks.1 0 1 496 0=1
BinaryOp                 mul_107                  2 1 496 494 497 0=2
Convolution              convrelu_42              1 1 495 498 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_43              1 1 498 499 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_108                  2 1 497 499 500 0=0
Convolution              convrelu_44              1 1 484 501 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Concat                   cat_12                   2 1 500 501 502 0=0
Convolution              convrelu_45              1 1 456 503 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144 9=1
Split                    splitncnn_54             1 2 503 504 505
Convolution              convrelu_46              1 1 504 506 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_165                 1 1 506 507 0=68 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4352
Reshape                  reshape_276              1 1 507 508 0=6400 1=17 11=4 2=-1
Convolution              convrelu_47              1 1 480 509 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Split                    splitncnn_55             1 2 509 510 511
Convolution              convrelu_48              1 1 510 512 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_170                 1 1 512 513 0=68 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8704
Reshape                  reshape_277              1 1 513 514 0=1600 1=17 11=4 2=-1
Convolution              convrelu_49              1 1 502 515 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152 9=1
Convolution              convrelu_50              1 1 515 516 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304 9=1
Split                    splitncnn_56             1 2 516 517 518
Convolution              convrelu_51              1 1 517 519 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_175                 1 1 519 520 0=68 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=17408
Reshape                  reshape_278              1 1 520 521 0=400 1=17 11=4 2=-1
Convolution              convrelu_52              1 1 518 522 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_173                 1 1 522 523 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20480
Convolution              convrelu_53              1 1 511 524 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_168                 1 1 524 525 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10240
Convolution              convrelu_54              1 1 505 526 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_163                 1 1 526 527 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5120
Reshape                  reshape_281              1 1 527 528 0=6400 1=80
Reshape                  reshape_280              1 1 525 529 0=1600 1=80
Reshape                  reshape_279              1 1 523 530 0=400 1=80
Concat                   cat_13                   3 1 528 529 530 531 0=1
Permute                  permute_284              1 1 521 532 0=3
Softmax                  softmax_3                1 1 532 533 0=0 1=1
Convolution              conv_176                 1 1 533 534 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=17
Permute                  permute_283              1 1 514 535 0=3
Softmax                  softmax_2                1 1 535 536 0=0 1=1
Convolution              conv_177                 1 1 536 537 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=17
Permute                  permute_282              1 1 508 538 0=3
Softmax                  softmax_1                1 1 538 539 0=0 1=1
Convolution              conv_178                 1 1 539 540 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=17
Squeeze                  squeeze_288              1 1 540 541 -23303=1,0
Squeeze                  squeeze_287              1 1 537 542 -23303=1,0
Squeeze                  squeeze_286              1 1 534 543 -23303=1,0
Concat                   cat_14                   3 1 541 542 543 out0 0=0
Permute                  permute_285              1 1 531 545 0=1
Sigmoid                  sigmoid_0                1 1 545 out1
