7767517
200 244
Input                    input.1                  0 1 input.1
MemoryData               /heads/Constant_2_output_0 0 1 /heads/Constant_2_output_0 0=1
Split                    splitncnn_0              1 3 /heads/Constant_2_output_0 /heads/Constant_2_output_0_splitncnn_0 /heads/Constant_2_output_0_splitncnn_1 /heads/Constant_2_output_0_splitncnn_2
Convolution              /backbone/stem/conv/rbr_reparam/Conv 1 1 input.1 /backbone/stem/conv/nonlinearity/Relu_output_0 0=48 1=3 3=2 4=1 5=1 6=1296 9=1
Convolution              /backbone/stage1/downsample/rbr_reparam/Conv 1 1 /backbone/stem/conv/nonlinearity/Relu_output_0 /backbone/stage1/downsample/nonlinearity/Relu_output_0 0=96 1=3 3=2 4=1 5=1 6=41472 9=1
Split                    splitncnn_1              1 2 /backbone/stage1/downsample/nonlinearity/Relu_output_0 /backbone/stage1/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage1/downsample/nonlinearity/Relu_output_0_splitncnn_1
Convolution              /backbone/stage1/blocks/conv1/conv/Conv 1 1 /backbone/stage1/downsample/nonlinearity/Relu_output_0_splitncnn_1 /backbone/stage1/blocks/conv1/act/Relu_output_0 0=32 1=1 5=1 6=3072 9=1
Split                    splitncnn_2              1 2 /backbone/stage1/blocks/conv1/act/Relu_output_0 /backbone/stage1/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage1/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /backbone/stage1/blocks/bottlenecks/bottlenecks.0/cv1/rbr_reparam/Conv 1 1 /backbone/stage1/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 0=32 1=3 4=1 5=1 6=9216 9=1
Convolution              /backbone/stage1/blocks/bottlenecks/bottlenecks.0/cv2/rbr_reparam/Conv 1 1 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 0=32 1=3 4=1 5=1 6=9216 9=1
Eltwise                  /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add 2 1 /backbone/stage1/blocks/conv1/act/Relu_output_0_splitncnn_1 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,7.408413e-01,1.000000e+00
Split                    splitncnn_3              1 2 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add_output_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /backbone/stage1/blocks/bottlenecks/bottlenecks.1/cv1/rbr_reparam/Conv 1 1 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 0=32 1=3 4=1 5=1 6=9216 9=1
Convolution              /backbone/stage1/blocks/bottlenecks/bottlenecks.1/cv2/rbr_reparam/Conv 1 1 /backbone/stage1/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 0=32 1=3 4=1 5=1 6=9216 9=1
Eltwise                  /backbone/stage1/blocks/bottlenecks/bottlenecks.1/Add 2 1 /backbone/stage1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /backbone/stage1/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 /backbone/stage1/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,6.585057e-01,1.000000e+00
Convolution              /backbone/stage1/blocks/conv2/conv/Conv 1 1 /backbone/stage1/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage1/blocks/conv2/act/Relu_output_0 0=32 1=1 5=1 6=3072 9=1
Concat                   /backbone/stage1/blocks/Concat 2 1 /backbone/stage1/blocks/bottlenecks/bottlenecks.1/Add_output_0 /backbone/stage1/blocks/conv2/act/Relu_output_0 /backbone/stage1/blocks/Concat_output_0
Convolution              /backbone/stage1/blocks/conv3/conv/Conv 1 1 /backbone/stage1/blocks/Concat_output_0 /backbone/stage1/blocks/conv3/act/Relu_output_0 0=96 1=1 5=1 6=6144 9=1
Split                    splitncnn_4              1 2 /backbone/stage1/blocks/conv3/act/Relu_output_0 /backbone/stage1/blocks/conv3/act/Relu_output_0_splitncnn_0 /backbone/stage1/blocks/conv3/act/Relu_output_0_splitncnn_1
Convolution              /backbone/stage2/downsample/rbr_reparam/Conv 1 1 /backbone/stage1/blocks/conv3/act/Relu_output_0_splitncnn_1 /backbone/stage2/downsample/nonlinearity/Relu_output_0 0=192 1=3 3=2 4=1 5=1 6=165888 9=1
Split                    splitncnn_5              1 2 /backbone/stage2/downsample/nonlinearity/Relu_output_0 /backbone/stage2/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage2/downsample/nonlinearity/Relu_output_0_splitncnn_1
Convolution              /backbone/stage2/blocks/conv1/conv/Conv 1 1 /backbone/stage2/downsample/nonlinearity/Relu_output_0_splitncnn_1 /backbone/stage2/blocks/conv1/act/Relu_output_0 0=64 1=1 5=1 6=12288 9=1
Split                    splitncnn_6              1 2 /backbone/stage2/blocks/conv1/act/Relu_output_0 /backbone/stage2/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage2/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /backbone/stage2/blocks/bottlenecks/bottlenecks.0/cv1/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /backbone/stage2/blocks/bottlenecks/bottlenecks.0/cv2/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add 2 1 /backbone/stage2/blocks/conv1/act/Relu_output_0_splitncnn_1 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,6.319700e-01,1.000000e+00
Split                    splitncnn_7              1 2 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /backbone/stage2/blocks/bottlenecks/bottlenecks.1/cv1/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /backbone/stage2/blocks/bottlenecks/bottlenecks.1/cv2/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add 2 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,8.222501e-01,1.000000e+00
Split                    splitncnn_8              1 2 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_1
Convolution              /backbone/stage2/blocks/bottlenecks/bottlenecks.2/cv1/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.2/cv1/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /backbone/stage2/blocks/bottlenecks/bottlenecks.2/cv2/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.2/cv1/nonlinearity/Relu_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.2/cv2/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /backbone/stage2/blocks/bottlenecks/bottlenecks.2/Add 2 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_1 /backbone/stage2/blocks/bottlenecks/bottlenecks.2/cv2/nonlinearity/Relu_output_0 /backbone/stage2/blocks/bottlenecks/bottlenecks.2/Add_output_0 0=1 -23301=2,7.052988e-01,1.000000e+00
Convolution              /backbone/stage2/blocks/conv2/conv/Conv 1 1 /backbone/stage2/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage2/blocks/conv2/act/Relu_output_0 0=64 1=1 5=1 6=12288 9=1
Concat                   /backbone/stage2/blocks/Concat 2 1 /backbone/stage2/blocks/bottlenecks/bottlenecks.2/Add_output_0 /backbone/stage2/blocks/conv2/act/Relu_output_0 /backbone/stage2/blocks/Concat_output_0
Convolution              /backbone/stage2/blocks/conv3/conv/Conv 1 1 /backbone/stage2/blocks/Concat_output_0 /backbone/stage2/blocks/conv3/act/Relu_output_0 0=192 1=1 5=1 6=24576 9=1
Split                    splitncnn_9              1 3 /backbone/stage2/blocks/conv3/act/Relu_output_0 /backbone/stage2/blocks/conv3/act/Relu_output_0_splitncnn_0 /backbone/stage2/blocks/conv3/act/Relu_output_0_splitncnn_1 /backbone/stage2/blocks/conv3/act/Relu_output_0_splitncnn_2
Convolution              /backbone/stage3/downsample/rbr_reparam/Conv 1 1 /backbone/stage2/blocks/conv3/act/Relu_output_0_splitncnn_2 /backbone/stage3/downsample/nonlinearity/Relu_output_0 0=384 1=3 3=2 4=1 5=1 6=663552 9=1
Split                    splitncnn_10             1 2 /backbone/stage3/downsample/nonlinearity/Relu_output_0 /backbone/stage3/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage3/downsample/nonlinearity/Relu_output_0_splitncnn_1
Convolution              /backbone/stage3/blocks/conv1/conv/Conv 1 1 /backbone/stage3/downsample/nonlinearity/Relu_output_0_splitncnn_1 /backbone/stage3/blocks/conv1/act/Relu_output_0 0=96 1=1 5=1 6=36864 9=1
Split                    splitncnn_11             1 2 /backbone/stage3/blocks/conv1/act/Relu_output_0 /backbone/stage3/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage3/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.0/cv1/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.0/cv2/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Eltwise                  /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add 2 1 /backbone/stage3/blocks/conv1/act/Relu_output_0_splitncnn_1 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,7.147958e-01,1.000000e+00
Split                    splitncnn_12             1 2 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.1/cv1/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.1/cv2/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Eltwise                  /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add 2 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,7.888203e-01,1.000000e+00
Split                    splitncnn_13             1 2 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.2/cv1/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/cv1/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.2/cv2/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/cv1/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/cv2/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Eltwise                  /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add 2 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.1/Add_output_0_splitncnn_1 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/cv2/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add_output_0 0=1 -23301=2,8.634844e-01,1.000000e+00
Split                    splitncnn_14             1 2 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add_output_0_splitncnn_1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.3/cv1/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/cv1/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.3/cv2/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/cv1/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/cv2/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Eltwise                  /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add 2 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.2/Add_output_0_splitncnn_1 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/cv2/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add_output_0 0=1 -23301=2,9.200779e-01,1.000000e+00
Split                    splitncnn_15             1 2 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add_output_0_splitncnn_1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.4/cv1/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add_output_0_splitncnn_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.4/cv1/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Convolution              /backbone/stage3/blocks/bottlenecks/bottlenecks.4/cv2/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.4/cv1/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.4/cv2/nonlinearity/Relu_output_0 0=96 1=3 4=1 5=1 6=82944 9=1
Eltwise                  /backbone/stage3/blocks/bottlenecks/bottlenecks.4/Add 2 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.3/Add_output_0_splitncnn_1 /backbone/stage3/blocks/bottlenecks/bottlenecks.4/cv2/nonlinearity/Relu_output_0 /backbone/stage3/blocks/bottlenecks/bottlenecks.4/Add_output_0 0=1 -23301=2,1.381722e-01,1.000000e+00
Convolution              /backbone/stage3/blocks/conv2/conv/Conv 1 1 /backbone/stage3/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage3/blocks/conv2/act/Relu_output_0 0=96 1=1 5=1 6=36864 9=1
Concat                   /backbone/stage3/blocks/Concat 2 1 /backbone/stage3/blocks/bottlenecks/bottlenecks.4/Add_output_0 /backbone/stage3/blocks/conv2/act/Relu_output_0 /backbone/stage3/blocks/Concat_output_0
Convolution              /backbone/stage3/blocks/conv3/conv/Conv 1 1 /backbone/stage3/blocks/Concat_output_0 /backbone/stage3/blocks/conv3/act/Relu_output_0 0=384 1=1 5=1 6=73728 9=1
Split                    splitncnn_16             1 2 /backbone/stage3/blocks/conv3/act/Relu_output_0 /backbone/stage3/blocks/conv3/act/Relu_output_0_splitncnn_0 /backbone/stage3/blocks/conv3/act/Relu_output_0_splitncnn_1
Convolution              /backbone/stage4/downsample/rbr_reparam/Conv 1 1 /backbone/stage3/blocks/conv3/act/Relu_output_0_splitncnn_1 /backbone/stage4/downsample/nonlinearity/Relu_output_0 0=768 1=3 3=2 4=1 5=1 6=2654208 9=1
Split                    splitncnn_17             1 2 /backbone/stage4/downsample/nonlinearity/Relu_output_0 /backbone/stage4/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage4/downsample/nonlinearity/Relu_output_0_splitncnn_1
Convolution              /backbone/stage4/blocks/conv1/conv/Conv 1 1 /backbone/stage4/downsample/nonlinearity/Relu_output_0_splitncnn_1 /backbone/stage4/blocks/conv1/act/Relu_output_0 0=192 1=1 5=1 6=147456 9=1
Split                    splitncnn_18             1 2 /backbone/stage4/blocks/conv1/act/Relu_output_0 /backbone/stage4/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage4/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /backbone/stage4/blocks/bottlenecks/bottlenecks.0/cv1/rbr_reparam/Conv 1 1 /backbone/stage4/blocks/conv1/act/Relu_output_0_splitncnn_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 0=192 1=3 4=1 5=1 6=331776 9=1
Convolution              /backbone/stage4/blocks/bottlenecks/bottlenecks.0/cv2/rbr_reparam/Conv 1 1 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 0=192 1=3 4=1 5=1 6=331776 9=1
Eltwise                  /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add 2 1 /backbone/stage4/blocks/conv1/act/Relu_output_0_splitncnn_1 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,7.671537e-01,1.000000e+00
Split                    splitncnn_19             1 2 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add_output_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /backbone/stage4/blocks/bottlenecks/bottlenecks.1/cv1/rbr_reparam/Conv 1 1 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 0=192 1=3 4=1 5=1 6=331776 9=1
Convolution              /backbone/stage4/blocks/bottlenecks/bottlenecks.1/cv2/rbr_reparam/Conv 1 1 /backbone/stage4/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 0=192 1=3 4=1 5=1 6=331776 9=1
Eltwise                  /backbone/stage4/blocks/bottlenecks/bottlenecks.1/Add 2 1 /backbone/stage4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /backbone/stage4/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 /backbone/stage4/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,5.776102e-03,1.000000e+00
Convolution              /backbone/stage4/blocks/conv2/conv/Conv 1 1 /backbone/stage4/downsample/nonlinearity/Relu_output_0_splitncnn_0 /backbone/stage4/blocks/conv2/act/Relu_output_0 0=192 1=1 5=1 6=147456 9=1
Concat                   /backbone/stage4/blocks/Concat 2 1 /backbone/stage4/blocks/bottlenecks/bottlenecks.1/Add_output_0 /backbone/stage4/blocks/conv2/act/Relu_output_0 /backbone/stage4/blocks/Concat_output_0
Convolution              /backbone/stage4/blocks/conv3/conv/Conv 1 1 /backbone/stage4/blocks/Concat_output_0 /backbone/stage4/blocks/conv3/act/Relu_output_0 0=768 1=1 5=1 6=294912 9=1
Convolution              /backbone/context_module/cv1/conv/Conv 1 1 /backbone/stage4/blocks/conv3/act/Relu_output_0 /backbone/context_module/cv1/act/Relu_output_0 0=384 1=1 5=1 6=294912 9=1
Split                    splitncnn_20             1 4 /backbone/context_module/cv1/act/Relu_output_0 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_0 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_1 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_2 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_3
Pooling                  /backbone/context_module/m.0/MaxPool 1 1 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_3 /backbone/context_module/m.0/MaxPool_output_0 1=5 3=2 5=1
Pooling                  /backbone/context_module/m.1/MaxPool 1 1 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_2 /backbone/context_module/m.1/MaxPool_output_0 1=9 3=4 5=1
Pooling                  /backbone/context_module/m.2/MaxPool 1 1 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_1 /backbone/context_module/m.2/MaxPool_output_0 1=13 3=6 5=1
Concat                   /backbone/context_module/Concat 4 1 /backbone/context_module/cv1/act/Relu_output_0_splitncnn_0 /backbone/context_module/m.0/MaxPool_output_0 /backbone/context_module/m.1/MaxPool_output_0 /backbone/context_module/m.2/MaxPool_output_0 /backbone/context_module/Concat_output_0
Convolution              /backbone/context_module/cv2/conv/Conv 1 1 /backbone/context_module/Concat_output_0 /backbone/context_module/cv2/act/Relu_output_0 0=768 1=1 5=1 6=1179648 9=1
Convolution              /neck/neck1/reduce_skip1/conv/Conv 1 1 /backbone/stage3/blocks/conv3/act/Relu_output_0_splitncnn_0 /neck/neck1/reduce_skip1/act/Relu_output_0 0=192 1=1 5=1 6=73728 9=1
Convolution              /neck/neck1/reduce_skip2/conv/Conv 1 1 /backbone/stage2/blocks/conv3/act/Relu_output_0_splitncnn_1 /neck/neck1/reduce_skip2/act/Relu_output_0 0=192 1=1 5=1 6=36864 9=1
Convolution              /neck/neck1/downsample/conv/Conv 1 1 /neck/neck1/reduce_skip2/act/Relu_output_0 /neck/neck1/downsample/act/Relu_output_0 0=192 1=3 3=2 4=1 5=1 6=331776 9=1
Convolution              /neck/neck1/conv/conv/Conv 1 1 /backbone/context_module/cv2/act/Relu_output_0 /neck/neck1/conv/act/Relu_output_0 0=192 1=1 5=1 6=147456 9=1
Split                    splitncnn_21             1 2 /neck/neck1/conv/act/Relu_output_0 /neck/neck1/conv/act/Relu_output_0_splitncnn_0 /neck/neck1/conv/act/Relu_output_0_splitncnn_1
Deconvolution            /neck/neck1/upsample/ConvTranspose 1 1 /neck/neck1/conv/act/Relu_output_0_splitncnn_1 /neck/neck1/upsample/ConvTranspose_output_0 0=192 1=2 3=2 5=1 6=147456
Concat                   /neck/neck1/Concat       3 1 /neck/neck1/upsample/ConvTranspose_output_0 /neck/neck1/reduce_skip1/act/Relu_output_0 /neck/neck1/downsample/act/Relu_output_0 /neck/neck1/Concat_output_0
Convolution              /neck/neck1/reduce_after_concat/conv/Conv 1 1 /neck/neck1/Concat_output_0 /neck/neck1/reduce_after_concat/act/Relu_output_0 0=192 1=1 5=1 6=110592 9=1
Split                    splitncnn_22             1 2 /neck/neck1/reduce_after_concat/act/Relu_output_0 /neck/neck1/reduce_after_concat/act/Relu_output_0_splitncnn_0 /neck/neck1/reduce_after_concat/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck1/blocks/conv1/conv/Conv 1 1 /neck/neck1/reduce_after_concat/act/Relu_output_0_splitncnn_1 /neck/neck1/blocks/conv1/act/Relu_output_0 0=64 1=1 5=1 6=12288 9=1
Split                    splitncnn_23             1 2 /neck/neck1/blocks/conv1/act/Relu_output_0 /neck/neck1/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck1/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck1/blocks/bottlenecks/bottlenecks.0/cv1/rbr_reparam/Conv 1 1 /neck/neck1/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck1/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /neck/neck1/blocks/bottlenecks/bottlenecks.0/cv2/rbr_reparam/Conv 1 1 /neck/neck1/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 /neck/neck1/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add 2 1 /neck/neck1/blocks/conv1/act/Relu_output_0_splitncnn_1 /neck/neck1/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,4.367372e-01,1.000000e+00
Split                    splitncnn_24             1 2 /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add_output_0 /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /neck/neck1/blocks/bottlenecks/bottlenecks.1/cv1/rbr_reparam/Conv 1 1 /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck1/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /neck/neck1/blocks/bottlenecks/bottlenecks.1/cv2/rbr_reparam/Conv 1 1 /neck/neck1/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 /neck/neck1/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /neck/neck1/blocks/bottlenecks/bottlenecks.1/Add 2 1 /neck/neck1/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /neck/neck1/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 /neck/neck1/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,1.353923e-02,1.000000e+00
Convolution              /neck/neck1/blocks/conv2/conv/Conv 1 1 /neck/neck1/reduce_after_concat/act/Relu_output_0_splitncnn_0 /neck/neck1/blocks/conv2/act/Relu_output_0 0=64 1=1 5=1 6=12288 9=1
Concat                   /neck/neck1/blocks/Concat 2 1 /neck/neck1/blocks/bottlenecks/bottlenecks.1/Add_output_0 /neck/neck1/blocks/conv2/act/Relu_output_0 /neck/neck1/blocks/Concat_output_0
Convolution              /neck/neck1/blocks/conv3/conv/Conv 1 1 /neck/neck1/blocks/Concat_output_0 /neck/neck1/blocks/conv3/act/Relu_output_0 0=192 1=1 5=1 6=24576 9=1
Convolution              /neck/neck2/reduce_skip1/conv/Conv 1 1 /backbone/stage2/blocks/conv3/act/Relu_output_0_splitncnn_0 /neck/neck2/reduce_skip1/act/Relu_output_0 0=96 1=1 5=1 6=18432 9=1
Convolution              /neck/neck2/reduce_skip2/conv/Conv 1 1 /backbone/stage1/blocks/conv3/act/Relu_output_0_splitncnn_0 /neck/neck2/reduce_skip2/act/Relu_output_0 0=96 1=1 5=1 6=9216 9=1
Convolution              /neck/neck2/downsample/conv/Conv 1 1 /neck/neck2/reduce_skip2/act/Relu_output_0 /neck/neck2/downsample/act/Relu_output_0 0=96 1=3 3=2 4=1 5=1 6=82944 9=1
Convolution              /neck/neck2/conv/conv/Conv 1 1 /neck/neck1/blocks/conv3/act/Relu_output_0 /neck/neck2/conv/act/Relu_output_0 0=96 1=1 5=1 6=18432 9=1
Split                    splitncnn_25             1 2 /neck/neck2/conv/act/Relu_output_0 /neck/neck2/conv/act/Relu_output_0_splitncnn_0 /neck/neck2/conv/act/Relu_output_0_splitncnn_1
Deconvolution            /neck/neck2/upsample/ConvTranspose 1 1 /neck/neck2/conv/act/Relu_output_0_splitncnn_1 /neck/neck2/upsample/ConvTranspose_output_0 0=96 1=2 3=2 5=1 6=36864
Concat                   /neck/neck2/Concat       3 1 /neck/neck2/upsample/ConvTranspose_output_0 /neck/neck2/reduce_skip1/act/Relu_output_0 /neck/neck2/downsample/act/Relu_output_0 /neck/neck2/Concat_output_0
Convolution              /neck/neck2/reduce_after_concat/conv/Conv 1 1 /neck/neck2/Concat_output_0 /neck/neck2/reduce_after_concat/act/Relu_output_0 0=96 1=1 5=1 6=27648 9=1
Split                    splitncnn_26             1 2 /neck/neck2/reduce_after_concat/act/Relu_output_0 /neck/neck2/reduce_after_concat/act/Relu_output_0_splitncnn_0 /neck/neck2/reduce_after_concat/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck2/blocks/conv1/conv/Conv 1 1 /neck/neck2/reduce_after_concat/act/Relu_output_0_splitncnn_1 /neck/neck2/blocks/conv1/act/Relu_output_0 0=48 1=1 5=1 6=4608 9=1
Split                    splitncnn_27             1 2 /neck/neck2/blocks/conv1/act/Relu_output_0 /neck/neck2/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck2/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck2/blocks/bottlenecks/bottlenecks.0/cv1/rbr_reparam/Conv 1 1 /neck/neck2/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck2/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 0=48 1=3 4=1 5=1 6=20736 9=1
Convolution              /neck/neck2/blocks/bottlenecks/bottlenecks.0/cv2/rbr_reparam/Conv 1 1 /neck/neck2/blocks/bottlenecks/bottlenecks.0/cv1/nonlinearity/Relu_output_0 /neck/neck2/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 0=48 1=3 4=1 5=1 6=20736 9=1
Eltwise                  /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add 2 1 /neck/neck2/blocks/conv1/act/Relu_output_0_splitncnn_1 /neck/neck2/blocks/bottlenecks/bottlenecks.0/cv2/nonlinearity/Relu_output_0 /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,2.729114e-02,1.000000e+00
Split                    splitncnn_28             1 2 /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add_output_0 /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /neck/neck2/blocks/bottlenecks/bottlenecks.1/cv1/rbr_reparam/Conv 1 1 /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck2/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 0=48 1=3 4=1 5=1 6=20736 9=1
Convolution              /neck/neck2/blocks/bottlenecks/bottlenecks.1/cv2/rbr_reparam/Conv 1 1 /neck/neck2/blocks/bottlenecks/bottlenecks.1/cv1/nonlinearity/Relu_output_0 /neck/neck2/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 0=48 1=3 4=1 5=1 6=20736 9=1
Eltwise                  /neck/neck2/blocks/bottlenecks/bottlenecks.1/Add 2 1 /neck/neck2/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /neck/neck2/blocks/bottlenecks/bottlenecks.1/cv2/nonlinearity/Relu_output_0 /neck/neck2/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,3.766926e-03,1.000000e+00
Convolution              /neck/neck2/blocks/conv2/conv/Conv 1 1 /neck/neck2/reduce_after_concat/act/Relu_output_0_splitncnn_0 /neck/neck2/blocks/conv2/act/Relu_output_0 0=48 1=1 5=1 6=4608 9=1
Concat                   /neck/neck2/blocks/Concat 2 1 /neck/neck2/blocks/bottlenecks/bottlenecks.1/Add_output_0 /neck/neck2/blocks/conv2/act/Relu_output_0 /neck/neck2/blocks/Concat_output_0
Convolution              /neck/neck2/blocks/conv3/conv/Conv 1 1 /neck/neck2/blocks/Concat_output_0 /neck/neck2/blocks/conv3/act/Relu_output_0 0=96 1=1 5=1 6=9216 9=1
Split                    splitncnn_29             1 2 /neck/neck2/blocks/conv3/act/Relu_output_0 /neck/neck2/blocks/conv3/act/Relu_output_0_splitncnn_0 /neck/neck2/blocks/conv3/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck3/conv/conv/Conv 1 1 /neck/neck2/blocks/conv3/act/Relu_output_0_splitncnn_1 /neck/neck3/conv/act/Relu_output_0 0=96 1=3 3=2 4=1 5=1 6=82944 9=1
Concat                   /neck/neck3/Concat       2 1 /neck/neck3/conv/act/Relu_output_0 /neck/neck2/conv/act/Relu_output_0_splitncnn_0 /neck/neck3/Concat_output_0
Split                    splitncnn_30             1 2 /neck/neck3/Concat_output_0 /neck/neck3/Concat_output_0_splitncnn_0 /neck/neck3/Concat_output_0_splitncnn_1
Convolution              /neck/neck3/blocks/conv1/conv/Conv 1 1 /neck/neck3/Concat_output_0_splitncnn_1 /neck/neck3/blocks/conv1/act/Relu_output_0 0=64 1=1 5=1 6=12288 9=1
Split                    splitncnn_31             1 2 /neck/neck3/blocks/conv1/act/Relu_output_0 /neck/neck3/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck3/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck3/blocks/bottlenecks/bottlenecks.0/cv1/conv/Conv 1 1 /neck/neck3/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck3/blocks/bottlenecks/bottlenecks.0/cv1/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /neck/neck3/blocks/bottlenecks/bottlenecks.0/cv2/conv/Conv 1 1 /neck/neck3/blocks/bottlenecks/bottlenecks.0/cv1/act/Relu_output_0 /neck/neck3/blocks/bottlenecks/bottlenecks.0/cv2/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add 2 1 /neck/neck3/blocks/conv1/act/Relu_output_0_splitncnn_1 /neck/neck3/blocks/bottlenecks/bottlenecks.0/cv2/act/Relu_output_0 /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,2.463168e-02,1.000000e+00
Split                    splitncnn_32             1 2 /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add_output_0 /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /neck/neck3/blocks/bottlenecks/bottlenecks.1/cv1/conv/Conv 1 1 /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck3/blocks/bottlenecks/bottlenecks.1/cv1/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /neck/neck3/blocks/bottlenecks/bottlenecks.1/cv2/conv/Conv 1 1 /neck/neck3/blocks/bottlenecks/bottlenecks.1/cv1/act/Relu_output_0 /neck/neck3/blocks/bottlenecks/bottlenecks.1/cv2/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /neck/neck3/blocks/bottlenecks/bottlenecks.1/Add 2 1 /neck/neck3/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /neck/neck3/blocks/bottlenecks/bottlenecks.1/cv2/act/Relu_output_0 /neck/neck3/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,-1.621203e-04,1.000000e+00
Convolution              /neck/neck3/blocks/conv2/conv/Conv 1 1 /neck/neck3/Concat_output_0_splitncnn_0 /neck/neck3/blocks/conv2/act/Relu_output_0 0=64 1=1 5=1 6=12288 9=1
Concat                   /neck/neck3/blocks/Concat 2 1 /neck/neck3/blocks/bottlenecks/bottlenecks.1/Add_output_0 /neck/neck3/blocks/conv2/act/Relu_output_0 /neck/neck3/blocks/Concat_output_0
Convolution              /neck/neck3/blocks/conv3/conv/Conv 1 1 /neck/neck3/blocks/Concat_output_0 /neck/neck3/blocks/conv3/act/Relu_output_0 0=192 1=1 5=1 6=24576 9=1
Split                    splitncnn_33             1 2 /neck/neck3/blocks/conv3/act/Relu_output_0 /neck/neck3/blocks/conv3/act/Relu_output_0_splitncnn_0 /neck/neck3/blocks/conv3/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck4/conv/conv/Conv 1 1 /neck/neck3/blocks/conv3/act/Relu_output_0_splitncnn_1 /neck/neck4/conv/act/Relu_output_0 0=192 1=3 3=2 4=1 5=1 6=331776 9=1
Concat                   /neck/neck4/Concat       2 1 /neck/neck4/conv/act/Relu_output_0 /neck/neck1/conv/act/Relu_output_0_splitncnn_0 /neck/neck4/Concat_output_0
Split                    splitncnn_34             1 2 /neck/neck4/Concat_output_0 /neck/neck4/Concat_output_0_splitncnn_0 /neck/neck4/Concat_output_0_splitncnn_1
Convolution              /neck/neck4/blocks/conv1/conv/Conv 1 1 /neck/neck4/Concat_output_0_splitncnn_1 /neck/neck4/blocks/conv1/act/Relu_output_0 0=64 1=1 5=1 6=24576 9=1
Split                    splitncnn_35             1 2 /neck/neck4/blocks/conv1/act/Relu_output_0 /neck/neck4/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck4/blocks/conv1/act/Relu_output_0_splitncnn_1
Convolution              /neck/neck4/blocks/bottlenecks/bottlenecks.0/cv1/conv/Conv 1 1 /neck/neck4/blocks/conv1/act/Relu_output_0_splitncnn_0 /neck/neck4/blocks/bottlenecks/bottlenecks.0/cv1/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /neck/neck4/blocks/bottlenecks/bottlenecks.0/cv2/conv/Conv 1 1 /neck/neck4/blocks/bottlenecks/bottlenecks.0/cv1/act/Relu_output_0 /neck/neck4/blocks/bottlenecks/bottlenecks.0/cv2/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add 2 1 /neck/neck4/blocks/conv1/act/Relu_output_0_splitncnn_1 /neck/neck4/blocks/bottlenecks/bottlenecks.0/cv2/act/Relu_output_0 /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add_output_0 0=1 -23301=2,3.641538e-03,1.000000e+00
Split                    splitncnn_36             1 2 /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add_output_0 /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1
Convolution              /neck/neck4/blocks/bottlenecks/bottlenecks.1/cv1/conv/Conv 1 1 /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_0 /neck/neck4/blocks/bottlenecks/bottlenecks.1/cv1/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /neck/neck4/blocks/bottlenecks/bottlenecks.1/cv2/conv/Conv 1 1 /neck/neck4/blocks/bottlenecks/bottlenecks.1/cv1/act/Relu_output_0 /neck/neck4/blocks/bottlenecks/bottlenecks.1/cv2/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Eltwise                  /neck/neck4/blocks/bottlenecks/bottlenecks.1/Add 2 1 /neck/neck4/blocks/bottlenecks/bottlenecks.0/Add_output_0_splitncnn_1 /neck/neck4/blocks/bottlenecks/bottlenecks.1/cv2/act/Relu_output_0 /neck/neck4/blocks/bottlenecks/bottlenecks.1/Add_output_0 0=1 -23301=2,0.000000e+00,1.000000e+00
Convolution              /neck/neck4/blocks/conv2/conv/Conv 1 1 /neck/neck4/Concat_output_0_splitncnn_0 /neck/neck4/blocks/conv2/act/Relu_output_0 0=64 1=1 5=1 6=24576 9=1
Concat                   /neck/neck4/blocks/Concat 2 1 /neck/neck4/blocks/bottlenecks/bottlenecks.1/Add_output_0 /neck/neck4/blocks/conv2/act/Relu_output_0 /neck/neck4/blocks/Concat_output_0
Convolution              /neck/neck4/blocks/conv3/conv/Conv 1 1 /neck/neck4/blocks/Concat_output_0 /neck/neck4/blocks/conv3/act/Relu_output_0 0=384 1=1 5=1 6=49152 9=1
Convolution              /heads/head1/stem/seq/conv/Conv 1 1 /neck/neck2/blocks/conv3/act/Relu_output_0_splitncnn_0 /heads/head1/stem/seq/act/Relu_output_0 0=64 1=1 5=1 6=6144 9=1
Split                    splitncnn_37             1 2 /heads/head1/stem/seq/act/Relu_output_0 /heads/head1/stem/seq/act/Relu_output_0_splitncnn_0 /heads/head1/stem/seq/act/Relu_output_0_splitncnn_1
Convolution              /heads/head1/cls_convs/cls_convs.0/seq/conv/Conv 1 1 /heads/head1/stem/seq/act/Relu_output_0_splitncnn_1 /heads/head1/cls_convs/cls_convs.0/seq/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /heads/head1/cls_pred/Conv 1 1 /heads/head1/cls_convs/cls_convs.0/seq/act/Relu_output_0 /heads/head1/cls_pred/Conv_output_0 0=80 1=1 5=1 6=5120
Convolution              /heads/head1/reg_convs/reg_convs.0/seq/conv/Conv 1 1 /heads/head1/stem/seq/act/Relu_output_0_splitncnn_0 /heads/head1/reg_convs/reg_convs.0/seq/act/Relu_output_0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              /heads/head1/reg_pred/Conv 1 1 /heads/head1/reg_convs/reg_convs.0/seq/act/Relu_output_0 /heads/head1/reg_pred/Conv_output_0 0=68 1=1 5=1 6=4352
Reshape                  /heads/Reshape           1 1 /heads/head1/reg_pred/Conv_output_0 /heads/Reshape_output_0 0=6400 1=17 2=4
Permute                  /heads/Transpose         1 1 /heads/Reshape_output_0 /heads/Transpose_output_0 0=3
Softmax                  /heads/Softmax           1 1 /heads/Transpose_output_0 /heads/Softmax_output_0
Convolution              /heads/Conv              1 1 /heads/Softmax_output_0 /heads/Conv_output_0 0=1 1=1 6=17
Squeeze                  /heads/Squeeze           2 1 /heads/Conv_output_0 /heads/Constant_2_output_0_splitncnn_2 /heads/Squeeze_output_0 0=1 1=1 2=1
Reshape                  /heads/Reshape_1         1 1 /heads/head1/cls_pred/Conv_output_0 /heads/Reshape_1_output_0 0=6400 1=80
Convolution              /heads/head2/stem/seq/conv/Conv 1 1 /neck/neck3/blocks/conv3/act/Relu_output_0_splitncnn_0 /heads/head2/stem/seq/act/Relu_output_0 0=128 1=1 5=1 6=24576 9=1
Split                    splitncnn_38             1 2 /heads/head2/stem/seq/act/Relu_output_0 /heads/head2/stem/seq/act/Relu_output_0_splitncnn_0 /heads/head2/stem/seq/act/Relu_output_0_splitncnn_1
Convolution              /heads/head2/cls_convs/cls_convs.0/seq/conv/Conv 1 1 /heads/head2/stem/seq/act/Relu_output_0_splitncnn_1 /heads/head2/cls_convs/cls_convs.0/seq/act/Relu_output_0 0=128 1=3 4=1 5=1 6=147456 9=1
Convolution              /heads/head2/cls_pred/Conv 1 1 /heads/head2/cls_convs/cls_convs.0/seq/act/Relu_output_0 /heads/head2/cls_pred/Conv_output_0 0=80 1=1 5=1 6=10240
Convolution              /heads/head2/reg_convs/reg_convs.0/seq/conv/Conv 1 1 /heads/head2/stem/seq/act/Relu_output_0_splitncnn_0 /heads/head2/reg_convs/reg_convs.0/seq/act/Relu_output_0 0=128 1=3 4=1 5=1 6=147456 9=1
Convolution              /heads/head2/reg_pred/Conv 1 1 /heads/head2/reg_convs/reg_convs.0/seq/act/Relu_output_0 /heads/head2/reg_pred/Conv_output_0 0=68 1=1 5=1 6=8704
Reshape                  /heads/Reshape_2         1 1 /heads/head2/reg_pred/Conv_output_0 /heads/Reshape_2_output_0 0=1600 1=17 2=4
Permute                  /heads/Transpose_1       1 1 /heads/Reshape_2_output_0 /heads/Transpose_1_output_0 0=3
Softmax                  /heads/Softmax_1         1 1 /heads/Transpose_1_output_0 /heads/Softmax_1_output_0
Convolution              /heads/Conv_1            1 1 /heads/Softmax_1_output_0 /heads/Conv_1_output_0 0=1 1=1 6=17
Squeeze                  /heads/Squeeze_1         2 1 /heads/Conv_1_output_0 /heads/Constant_2_output_0_splitncnn_1 /heads/Squeeze_1_output_0 0=1 1=1 2=1
Reshape                  /heads/Reshape_3         1 1 /heads/head2/cls_pred/Conv_output_0 /heads/Reshape_3_output_0 0=1600 1=80
Convolution              /heads/head3/stem/seq/conv/Conv 1 1 /neck/neck4/blocks/conv3/act/Relu_output_0 /heads/head3/stem/seq/act/Relu_output_0 0=256 1=1 5=1 6=98304 9=1
Split                    splitncnn_39             1 2 /heads/head3/stem/seq/act/Relu_output_0 /heads/head3/stem/seq/act/Relu_output_0_splitncnn_0 /heads/head3/stem/seq/act/Relu_output_0_splitncnn_1
Convolution              /heads/head3/cls_convs/cls_convs.0/seq/conv/Conv 1 1 /heads/head3/stem/seq/act/Relu_output_0_splitncnn_1 /heads/head3/cls_convs/cls_convs.0/seq/act/Relu_output_0 0=256 1=3 4=1 5=1 6=589824 9=1
Convolution              /heads/head3/cls_pred/Conv 1 1 /heads/head3/cls_convs/cls_convs.0/seq/act/Relu_output_0 /heads/head3/cls_pred/Conv_output_0 0=80 1=1 5=1 6=20480
Convolution              /heads/head3/reg_convs/reg_convs.0/seq/conv/Conv 1 1 /heads/head3/stem/seq/act/Relu_output_0_splitncnn_0 /heads/head3/reg_convs/reg_convs.0/seq/act/Relu_output_0 0=256 1=3 4=1 5=1 6=589824 9=1
Convolution              /heads/head3/reg_pred/Conv 1 1 /heads/head3/reg_convs/reg_convs.0/seq/act/Relu_output_0 /heads/head3/reg_pred/Conv_output_0 0=68 1=1 5=1 6=17408
Reshape                  /heads/Reshape_4         1 1 /heads/head3/reg_pred/Conv_output_0 /heads/Reshape_4_output_0 0=400 1=17 2=4
Permute                  /heads/Transpose_2       1 1 /heads/Reshape_4_output_0 /heads/Transpose_2_output_0 0=3
Softmax                  /heads/Softmax_2         1 1 /heads/Transpose_2_output_0 /heads/Softmax_2_output_0
Convolution              /heads/Conv_2            1 1 /heads/Softmax_2_output_0 /heads/Conv_2_output_0 0=1 1=1 6=17
Squeeze                  /heads/Squeeze_2         2 1 /heads/Conv_2_output_0 /heads/Constant_2_output_0_splitncnn_0 /heads/Squeeze_2_output_0 0=1 1=1 2=1
Reshape                  /heads/Reshape_5         1 1 /heads/head3/cls_pred/Conv_output_0 /heads/Reshape_5_output_0 0=400 1=80
Concat                   /heads/Concat            3 1 /heads/Reshape_1_output_0 /heads/Reshape_3_output_0 /heads/Reshape_5_output_0 /heads/Concat_output_0 0=-1
Permute                  /heads/Transpose_3       1 1 /heads/Concat_output_0 /heads/Transpose_3_output_0 0=1
Concat                   /heads/Concat_1          3 1 /heads/Squeeze_output_0 /heads/Squeeze_1_output_0 /heads/Squeeze_2_output_0 1048
Sigmoid                  /heads/Sigmoid           1 1 /heads/Transpose_3_output_0 1049
