7767517
1728 2130
SherpaMetaData           sherpa_meta_data1        0 0 0=2 1=32 2=4 3=7 15=1 -23316=5,2,3,2,2,3 -23317=5,160,160,160,160,160 -23318=5,96,96,96,96,96 -23319=5,1,2,4,8,2 -23320=5,31,31,31,31,31
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Input                    in2                      0 1 in2
Split                    splitncnn_1              1 3 in2 5 6 7
Input                    in3                      0 1 in3
Split                    splitncnn_2              1 2 in3 9 10
Input                    in4                      0 1 in4
Split                    splitncnn_3              1 2 in4 12 13
Input                    in5                      0 1 in5
Split                    splitncnn_4              1 3 in5 15 16 17
Input                    in6                      0 1 in6
Split                    splitncnn_5              1 2 in6 19 20
Input                    in7                      0 1 in7
Split                    splitncnn_6              1 3 in7 22 23 24
Input                    in8                      0 1 in8
Split                    splitncnn_7              1 2 in8 26 27
Input                    in9                      0 1 in9
Split                    splitncnn_8              1 2 in9 29 30
Input                    in10                     0 1 in10
Split                    splitncnn_9              1 3 in10 32 33 34
Input                    in11                     0 1 in11
Split                    splitncnn_10             1 2 in11 36 37
Input                    in12                     0 1 in12
Split                    splitncnn_11             1 3 in12 39 40 41
Input                    in13                     0 1 in13
Split                    splitncnn_12             1 2 in13 43 44
Input                    in14                     0 1 in14
Split                    splitncnn_13             1 2 in14 46 47
Input                    in15                     0 1 in15
Split                    splitncnn_14             1 3 in15 49 50 51
Input                    in16                     0 1 in16
Split                    splitncnn_15             1 2 in16 53 54
Input                    in17                     0 1 in17
Split                    splitncnn_16             1 3 in17 56 57 58
Input                    in18                     0 1 in18
Split                    splitncnn_17             1 2 in18 60 61
Input                    in19                     0 1 in19
Split                    splitncnn_18             1 2 in19 63 64
Input                    in20                     0 1 in20
Split                    splitncnn_19             1 3 in20 66 67 68
Input                    in21                     0 1 in21
Split                    splitncnn_20             1 2 in21 70 71
Input                    in22                     0 1 in22
Split                    splitncnn_21             1 3 in22 73 74 75
Input                    in23                     0 1 in23
Split                    splitncnn_22             1 2 in23 77 78
Input                    in24                     0 1 in24
Split                    splitncnn_23             1 2 in24 80 81
Input                    in25                     0 1 in25
Split                    splitncnn_24             1 3 in25 83 84 85
Input                    in26                     0 1 in26
Split                    splitncnn_25             1 2 in26 87 88
Input                    in27                     0 1 in27
Split                    splitncnn_26             1 3 in27 90 91 92
Input                    in28                     0 1 in28
Split                    splitncnn_27             1 2 in28 94 95
Input                    in29                     0 1 in29
Split                    splitncnn_28             1 2 in29 97 98
Input                    in30                     0 1 in30
Split                    splitncnn_29             1 3 in30 100 101 102
Input                    in31                     0 1 in31
Split                    splitncnn_30             1 2 in31 104 105
Input                    in32                     0 1 in32
Split                    splitncnn_31             1 3 in32 107 108 109
Input                    in33                     0 1 in33
Split                    splitncnn_32             1 2 in33 111 112
Input                    in34                     0 1 in34
Split                    splitncnn_33             1 2 in34 114 115
Input                    in35                     0 1 in35
Split                    splitncnn_34             1 3 in35 117 118 119
MemoryData               encoders.4.encoder.layers.2 0 1 120 0=1
MemoryData               encoders.4.encoder.layers.1 0 1 121 0=1
MemoryData               encoders.4.encoder.layers.0 0 1 122 0=1
MemoryData               encoders.4.encoder.encoder_pos 0 1 123 0=160 1=47
MemoryData               encoders.4.encoder.encoder_pos_2 0 1 124 0=160 1=47
MemoryData               encoders.4.encoder.encoder_pos_1 0 1 125 0=160 1=47
MemoryData               encoders.3.encoder.layers.1 0 1 126 0=1
MemoryData               encoders.3.encoder.layers.0 0 1 127 0=1
MemoryData               encoders.3.encoder.encoder_pos 0 1 128 0=160 1=11
MemoryData               encoders.3.encoder.encoder_pos_1 0 1 129 0=160 1=11
MemoryData               encoders.2.encoder.layers.1 0 1 130 0=1
MemoryData               encoders.2.encoder.layers.0 0 1 131 0=1
MemoryData               encoders.2.encoder.encoder_pos 0 1 132 0=160 1=23
MemoryData               encoders.2.encoder.encoder_pos_1 0 1 133 0=160 1=23
MemoryData               encoders.1.encoder.layers.2 0 1 134 0=1
MemoryData               encoders.1.encoder.layers.1 0 1 135 0=1
MemoryData               encoders.1.encoder.layers.0 0 1 136 0=1
MemoryData               encoders.1.encoder.encoder_pos 0 1 137 0=160 1=47
MemoryData               encoders.1.encoder.encoder_pos_2 0 1 138 0=160 1=47
MemoryData               encoders.1.encoder.encoder_pos_1 0 1 139 0=160 1=47
MemoryData               encoders.0.layers.1      0 1 140 0=1
MemoryData               encoders.0.layers.0      0 1 141 0=1
MemoryData               encoders.0.encoder_pos   0 1 142 0=160 1=95
MemoryData               encoders.0.encoder_pos_1 0 1 143 0=160 1=95
ExpandDims               unsqueeze_595            1 1 in0 144 -23303=1,0
Convolution              conv_152                 1 1 144 145 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_35             1 2 145 146 147
BinaryOp                 sub_0                    1 1 146 148 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_24               1 1 148 149
BinaryOp                 mul_1                    2 1 147 149 150 0=2
Convolution              conv_153                 1 1 150 151 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_36             1 2 151 152 153
BinaryOp                 sub_2                    1 1 152 154 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_25               1 1 154 155
BinaryOp                 mul_3                    2 1 153 155 156 0=2
Convolution              conv_154                 1 1 156 157 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_37             1 2 157 158 159
BinaryOp                 sub_4                    1 1 158 160 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_26               1 1 160 161
BinaryOp                 mul_5                    2 1 159 161 162 0=2
Crop                     crop_596                 1 1 3 163 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.0.state_select_list.0_ncnnreshape0 1 1 163 164 0=0 1=0
Crop                     crop_597                 1 1 20 165 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_12_ncnnreshape0 1 1 165 166 0=0 1=0
Crop                     crop_598                 1 1 37 167 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_13_ncnnreshape0 1 1 167 168 0=0 1=0
Crop                     crop_599                 1 1 54 169 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_14_ncnnreshape0 1 1 169 170 0=0 1=0
Crop                     crop_600                 1 1 71 171 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_15_ncnnreshape0 1 1 171 172 0=0 1=0
Crop                     crop_601                 1 1 88 173 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_16_ncnnreshape0 1 1 173 174 0=0 1=0
Crop                     crop_602                 1 1 105 175 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_17_ncnnreshape0 1 1 175 176 0=0 1=0
Permute                  permute_534              1 1 162 177 0=2
Reshape                  reshape_300              1 1 177 178 0=2432 1=-1
InnerProduct             linear_155               1 1 178 179 0=160 1=1 2=389120
Split                    splitncnn_38             1 4 179 180 181 182 183
InnerProduct             linear_156               1 1 183 184 0=320 1=1 2=51200
Split                    splitncnn_39             1 2 184 185 186
BinaryOp                 sub_6                    1 1 185 187 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_27               1 1 187 188
BinaryOp                 mul_7                    2 1 186 188 189 0=2
InnerProduct             linear_157               1 1 189 190 0=160 1=1 2=51200
BinaryOp                 add_8                    2 1 180 190 191 0=0
Split                    splitncnn_40             1 2 191 192 193
PoolingModuleNoProj      pooling_modul_no_proj_776 3 3 193 164 166 194 195 196
InnerProduct             linear_158               1 1 194 197 0=160 1=0 2=25600
BinaryOp                 add_9                    2 1 192 197 198 0=0
Split                    splitncnn_41             1 2 198 199 200
InnerProduct             linear_159               1 1 200 201 0=256 1=1 2=40960
Slice                    tensor_split_0           1 4 201 202 203 204 205 -23300=4,96,96,48,-233 1=1
Concat                   cat_0                    2 1 170 204 206 0=0
Split                    splitncnn_42             1 2 206 207 208
Reshape                  reshape_301              1 1 207 209 0=12 1=4 2=80
Reshape                  reshape_302              1 1 202 210 0=24 1=4 2=16
Reshape                  reshape_303              1 1 205 211 0=4 1=4 2=16
Concat                   cat_1                    2 1 168 203 212 0=0
Split                    splitncnn_43             1 2 212 213 214
Reshape                  reshape_304              1 1 213 215 0=24 1=4 2=80
InnerProduct             linear_160               1 1 142 216 0=16 1=0 2=2560
Reshape                  reshape_305              1 1 216 217 0=4 1=4 2=95
Permute                  permute_684              1 1 217 218 0=3
Permute                  permute_682              1 1 211 219 0=2
MatMul                   matmul_498               2 1 219 218 220
Permute                  permute_683              1 1 215 221 0=3
Permute                  permute_681              1 1 210 222 0=2
MatMul                   matmul_499               2 1 222 221 223
TensorAsStrided          tensor_as_strided_788    1 1 220 224 -23300=3,4,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_10                   2 1 223 224 225 0=0
Reshape                  view_462                 1 1 225 226 0=80 1=16 2=4
Softmax                  softmax_87               1 1 226 227 0=-1 1=1
Split                    splitncnn_44             1 2 227 228 229
Permute                  permute_680              1 1 209 230 0=2
MatMul                   bmm_474                  2 1 229 230 231
Permute                  permute_685              1 1 231 232 0=2
Reshape                  reshape_306              1 1 232 233 0=48 1=16
InnerProduct             linear_161               1 1 233 234 0=160 1=1 2=7680
BinaryOp                 add_11                   2 1 199 234 235 0=0
Split                    splitncnn_45             1 2 235 236 237
Permute                  permute_536              1 1 237 238 0=1
Convolution1D            conv1d_104               1 1 238 239 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_0                    1 1 239 240 0=0
Concat                   cat_2                    2 1 174 240 241 0=1
Split                    splitncnn_46             1 2 241 242 243
ConvolutionDepthWise1D   convdw1d_809             1 1 243 244 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_47             1 2 244 245 246
BinaryOp                 sub_12                   1 1 245 247 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_28               1 1 247 248
BinaryOp                 mul_13                   2 1 246 248 249 0=2
Convolution1D            conv1d_105               1 1 249 250 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_537              1 1 250 251 0=1
BinaryOp                 add_14                   2 1 236 251 252 0=0
Split                    splitncnn_48             1 2 252 253 254
InnerProduct             linear_162               1 1 254 255 0=320 1=1 2=51200
Split                    splitncnn_49             1 2 255 256 257
BinaryOp                 sub_15                   1 1 256 258 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_29               1 1 258 259
BinaryOp                 mul_16                   2 1 257 259 260 0=2
InnerProduct             linear_163               1 1 260 261 0=160 1=1 2=51200
BinaryOp                 add_17                   2 1 253 261 262 0=0
Split                    splitncnn_50             1 2 262 263 264
InnerProduct             linear_164               1 1 264 265 0=48 1=0 2=7680
Concat                   cat_3                    2 1 172 265 266 0=0
Split                    splitncnn_51             1 2 266 267 268
Reshape                  reshape_307              1 1 267 269 0=12 1=4 2=80
Permute                  permute_686              1 1 269 270 0=2
MatMul                   bmm_475                  2 1 228 270 271
Permute                  permute_687              1 1 271 272 0=2
Reshape                  reshape_308              1 1 272 273 0=48 1=16
InnerProduct             linear_165               1 1 273 274 0=160 1=1 2=7680
BinaryOp                 add_18                   2 1 263 274 275 0=0
Split                    splitncnn_52             1 2 275 276 277
Permute                  permute_538              1 1 277 278 0=1
Convolution1D            conv1d_106               1 1 278 279 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_1                    1 1 279 280 0=0
Concat                   cat_4                    2 1 176 280 281 0=1
Split                    splitncnn_53             1 2 281 282 283
ConvolutionDepthWise1D   convdw1d_810             1 1 283 284 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_54             1 2 284 285 286
BinaryOp                 sub_19                   1 1 285 287 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 287 288
BinaryOp                 mul_20                   2 1 286 288 289 0=2
Convolution1D            conv1d_107               1 1 289 290 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_539              1 1 290 291 0=1
BinaryOp                 add_21                   2 1 276 291 292 0=0
Split                    splitncnn_55             1 2 292 293 294
InnerProduct             linear_166               1 1 294 295 0=320 1=1 2=51200
Split                    splitncnn_56             1 2 295 296 297
BinaryOp                 sub_22                   1 1 296 298 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 298 299
BinaryOp                 mul_23                   2 1 297 299 300 0=2
InnerProduct             linear_167               1 1 300 301 0=160 1=1 2=51200
BinaryOp                 add_24                   2 1 293 301 302 0=0
Split                    splitncnn_57             1 3 302 303 304 305
BinaryOp                 mul_25                   2 1 303 304 306 0=2
Reduction                mean_522                 1 1 306 307 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_26                   1 1 307 308 0=0 1=1 2=4.114059e+00
BinaryOp                 pow_27                   1 1 308 309 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_28                   2 1 305 309 310 0=2
BinaryOp                 sub_29                   2 1 310 181 311 0=1
BinaryOp                 mul_30                   2 1 311 141 312 0=2
BinaryOp                 add_31                   2 1 182 312 313 0=0
Split                    splitncnn_58             1 4 313 314 315 316 317
Crop                     crop_603                 1 1 2 318 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.0.state_select_list.1_ncnnreshape0 1 1 318 319 0=0 1=0
Crop                     crop_604                 1 1 19 320 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_24_ncnnreshape0 1 1 320 321 0=0 1=0
Crop                     crop_605                 1 1 36 322 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_25_ncnnreshape0 1 1 322 323 0=0 1=0
Crop                     crop_606                 1 1 53 324 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_26_ncnnreshape0 1 1 324 325 0=0 1=0
Crop                     crop_607                 1 1 70 326 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_27_ncnnreshape0 1 1 326 327 0=0 1=0
Crop                     crop_608                 1 1 87 328 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_28_ncnnreshape0 1 1 328 329 0=0 1=0
Crop                     crop_609                 1 1 104 330 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_29_ncnnreshape0 1 1 330 331 0=0 1=0
InnerProduct             linear_168               1 1 317 332 0=320 1=1 2=51200
Split                    splitncnn_59             1 2 332 333 334
BinaryOp                 sub_32                   1 1 333 335 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 335 336
BinaryOp                 mul_33                   2 1 334 336 337 0=2
InnerProduct             linear_169               1 1 337 338 0=160 1=1 2=51200
BinaryOp                 add_34                   2 1 314 338 339 0=0
Split                    splitncnn_60             1 2 339 340 341
PoolingModuleNoProj      pooling_modul_no_proj_777 3 3 341 319 321 342 343 344
InnerProduct             linear_170               1 1 342 345 0=160 1=0 2=25600
BinaryOp                 add_35                   2 1 340 345 346 0=0
Split                    splitncnn_61             1 2 346 347 348
InnerProduct             linear_171               1 1 348 349 0=256 1=1 2=40960
Slice                    tensor_split_1           1 4 349 350 351 352 353 -23300=4,96,96,48,-233 1=1
Concat                   cat_5                    2 1 325 352 354 0=0
Split                    splitncnn_62             1 2 354 355 356
Reshape                  reshape_309              1 1 355 357 0=12 1=4 2=80
Reshape                  reshape_310              1 1 350 358 0=24 1=4 2=16
Reshape                  reshape_311              1 1 353 359 0=4 1=4 2=16
Concat                   cat_6                    2 1 323 351 360 0=0
Split                    splitncnn_63             1 2 360 361 362
Reshape                  reshape_312              1 1 361 363 0=24 1=4 2=80
InnerProduct             linear_172               1 1 143 364 0=16 1=0 2=2560
Reshape                  reshape_313              1 1 364 365 0=4 1=4 2=95
Permute                  permute_692              1 1 365 366 0=3
Permute                  permute_690              1 1 359 367 0=2
MatMul                   matmul_500               2 1 367 366 368
Permute                  permute_691              1 1 363 369 0=3
Permute                  permute_689              1 1 358 370 0=2
MatMul                   matmul_501               2 1 370 369 371
TensorAsStrided          tensor_as_strided_789    1 1 368 372 -23300=3,4,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_36                   2 1 371 372 373 0=0
Reshape                  view_463                 1 1 373 374 0=80 1=16 2=4
Softmax                  softmax_88               1 1 374 375 0=-1 1=1
Split                    splitncnn_64             1 2 375 376 377
Permute                  permute_688              1 1 357 378 0=2
MatMul                   bmm_476                  2 1 377 378 379
Permute                  permute_693              1 1 379 380 0=2
Reshape                  reshape_314              1 1 380 381 0=48 1=16
InnerProduct             linear_173               1 1 381 382 0=160 1=1 2=7680
BinaryOp                 add_37                   2 1 347 382 383 0=0
Split                    splitncnn_65             1 2 383 384 385
Permute                  permute_540              1 1 385 386 0=1
Convolution1D            conv1d_108               1 1 386 387 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_2                    1 1 387 388 0=0
Concat                   cat_7                    2 1 329 388 389 0=1
Split                    splitncnn_66             1 2 389 390 391
ConvolutionDepthWise1D   convdw1d_811             1 1 391 392 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_67             1 2 392 393 394
BinaryOp                 sub_38                   1 1 393 395 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 395 396
BinaryOp                 mul_39                   2 1 394 396 397 0=2
Convolution1D            conv1d_109               1 1 397 398 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_541              1 1 398 399 0=1
BinaryOp                 add_40                   2 1 384 399 400 0=0
Split                    splitncnn_68             1 2 400 401 402
InnerProduct             linear_174               1 1 402 403 0=320 1=1 2=51200
Split                    splitncnn_69             1 2 403 404 405
BinaryOp                 sub_41                   1 1 404 406 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 406 407
BinaryOp                 mul_42                   2 1 405 407 408 0=2
InnerProduct             linear_175               1 1 408 409 0=160 1=1 2=51200
BinaryOp                 add_43                   2 1 401 409 410 0=0
Split                    splitncnn_70             1 2 410 411 412
InnerProduct             linear_176               1 1 412 413 0=48 1=0 2=7680
Concat                   cat_8                    2 1 327 413 414 0=0
Split                    splitncnn_71             1 2 414 415 416
Reshape                  reshape_315              1 1 415 417 0=12 1=4 2=80
Permute                  permute_694              1 1 417 418 0=2
MatMul                   bmm_477                  2 1 376 418 419
Permute                  permute_695              1 1 419 420 0=2
Reshape                  reshape_316              1 1 420 421 0=48 1=16
InnerProduct             linear_177               1 1 421 422 0=160 1=1 2=7680
BinaryOp                 add_44                   2 1 411 422 423 0=0
Split                    splitncnn_72             1 2 423 424 425
Permute                  permute_542              1 1 425 426 0=1
Convolution1D            conv1d_110               1 1 426 427 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_3                    1 1 427 428 0=0
Concat                   cat_9                    2 1 331 428 429 0=1
Split                    splitncnn_73             1 2 429 430 431
ConvolutionDepthWise1D   convdw1d_812             1 1 431 432 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_74             1 2 432 433 434
BinaryOp                 sub_45                   1 1 433 435 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 435 436
BinaryOp                 mul_46                   2 1 434 436 437 0=2
Convolution1D            conv1d_111               1 1 437 438 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_543              1 1 438 439 0=1
BinaryOp                 add_47                   2 1 424 439 440 0=0
Split                    splitncnn_75             1 2 440 441 442
InnerProduct             linear_178               1 1 442 443 0=320 1=1 2=51200
Split                    splitncnn_76             1 2 443 444 445
BinaryOp                 sub_48                   1 1 444 446 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 446 447
BinaryOp                 mul_49                   2 1 445 447 448 0=2
InnerProduct             linear_179               1 1 448 449 0=160 1=1 2=51200
BinaryOp                 add_50                   2 1 441 449 450 0=0
Split                    splitncnn_77             1 3 450 451 452 453
BinaryOp                 mul_51                   2 1 451 452 454 0=2
Reduction                mean_523                 1 1 454 455 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_52                   1 1 455 456 0=0 1=1 2=6.826231e+00
BinaryOp                 pow_53                   1 1 456 457 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_54                   2 1 453 457 458 0=2
BinaryOp                 sub_55                   2 1 458 315 459 0=1
BinaryOp                 mul_56                   2 1 459 140 460 0=2
BinaryOp                 add_57                   2 1 316 460 461 0=0
Split                    splitncnn_78             1 2 461 462 463
MemoryData               encoders.1.downsample    0 1 464 0=160 1=1 2=1
Reshape                  reshape_317              1 1 463 465 0=160 1=2 2=8
Split                    splitncnn_79             1 2 465 466 467
BinaryOp                 mul_58                   2 1 466 464 468 0=2
Reduction                sum_585                  1 1 468 469 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_89               1 1 469 470 0=1 1=1
BinaryOp                 mul_59                   2 1 467 470 471 0=2
Reduction                sum_586                  1 1 471 472 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_610                 1 1 7 473 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 473 474 0=0 1=0
Crop                     crop_611                 1 1 24 475 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_37_ncnnreshape0 1 1 475 476 0=0 1=0
Crop                     crop_612                 1 1 41 477 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_38_ncnnreshape0 1 1 477 478 0=0 1=0
Crop                     crop_613                 1 1 58 479 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_39_ncnnreshape0 1 1 479 480 0=0 1=0
Crop                     crop_614                 1 1 75 481 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_40_ncnnreshape0 1 1 481 482 0=0 1=0
Crop                     crop_615                 1 1 92 483 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_41_ncnnreshape0 1 1 483 484 0=0 1=0
Crop                     crop_616                 1 1 109 485 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_42_ncnnreshape0 1 1 485 486 0=0 1=0
Split                    splitncnn_80             1 4 472 487 488 489 490
InnerProduct             linear_180               1 1 490 491 0=320 1=1 2=51200
Split                    splitncnn_81             1 2 491 492 493
BinaryOp                 sub_60                   1 1 492 494 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 494 495
BinaryOp                 mul_61                   2 1 493 495 496 0=2
InnerProduct             linear_181               1 1 496 497 0=160 1=1 2=51200
BinaryOp                 add_62                   2 1 487 497 498 0=0
Split                    splitncnn_82             1 2 498 499 500
PoolingModuleNoProj      pooling_modul_no_proj_778 3 3 500 474 476 501 502 503
InnerProduct             linear_182               1 1 501 504 0=160 1=0 2=25600
BinaryOp                 add_63                   2 1 499 504 505 0=0
Split                    splitncnn_83             1 2 505 506 507
InnerProduct             linear_183               1 1 507 508 0=256 1=1 2=40960
Slice                    tensor_split_2           1 4 508 509 510 511 512 -23300=4,96,96,48,-233 1=1
Concat                   cat_10                   2 1 480 511 513 0=0
Split                    splitncnn_84             1 2 513 514 515
Reshape                  reshape_318              1 1 514 516 0=12 1=4 2=40
Reshape                  reshape_319              1 1 509 517 0=24 1=4 2=8
Reshape                  reshape_320              1 1 512 518 0=4 1=4 2=8
Concat                   cat_11                   2 1 478 510 519 0=0
Split                    splitncnn_85             1 2 519 520 521
Reshape                  reshape_321              1 1 520 522 0=24 1=4 2=40
InnerProduct             linear_184               1 1 137 523 0=16 1=0 2=2560
Reshape                  reshape_322              1 1 523 524 0=4 1=4 2=47
Permute                  permute_700              1 1 524 525 0=3
Permute                  permute_698              1 1 518 526 0=2
MatMul                   matmul_502               2 1 526 525 527
Permute                  permute_699              1 1 522 528 0=3
Permute                  permute_697              1 1 517 529 0=2
MatMul                   matmul_503               2 1 529 528 530
TensorAsStrided          tensor_as_strided_790    1 1 527 531 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_64                   2 1 530 531 532 0=0
Reshape                  view_464                 1 1 532 533 0=40 1=8 2=4
Softmax                  softmax_90               1 1 533 534 0=-1 1=1
Split                    splitncnn_86             1 2 534 535 536
Permute                  permute_696              1 1 516 537 0=2
MatMul                   bmm_478                  2 1 536 537 538
Permute                  permute_701              1 1 538 539 0=2
Reshape                  reshape_323              1 1 539 540 0=48 1=8
InnerProduct             linear_185               1 1 540 541 0=160 1=1 2=7680
BinaryOp                 add_65                   2 1 506 541 542 0=0
Split                    splitncnn_87             1 2 542 543 544
Permute                  permute_544              1 1 544 545 0=1
Convolution1D            conv1d_112               1 1 545 546 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_4                    1 1 546 547 0=0
Concat                   cat_12                   2 1 484 547 548 0=1
Split                    splitncnn_88             1 2 548 549 550
ConvolutionDepthWise1D   convdw1d_813             1 1 550 551 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_89             1 2 551 552 553
BinaryOp                 sub_66                   1 1 552 554 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 554 555
BinaryOp                 mul_67                   2 1 553 555 556 0=2
Convolution1D            conv1d_113               1 1 556 557 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_545              1 1 557 558 0=1
BinaryOp                 add_68                   2 1 543 558 559 0=0
Split                    splitncnn_90             1 2 559 560 561
InnerProduct             linear_186               1 1 561 562 0=320 1=1 2=51200
Split                    splitncnn_91             1 2 562 563 564
BinaryOp                 sub_69                   1 1 563 565 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 565 566
BinaryOp                 mul_70                   2 1 564 566 567 0=2
InnerProduct             linear_187               1 1 567 568 0=160 1=1 2=51200
BinaryOp                 add_71                   2 1 560 568 569 0=0
Split                    splitncnn_92             1 2 569 570 571
InnerProduct             linear_188               1 1 571 572 0=48 1=0 2=7680
Concat                   cat_13                   2 1 482 572 573 0=0
Split                    splitncnn_93             1 2 573 574 575
Reshape                  reshape_324              1 1 574 576 0=12 1=4 2=40
Permute                  permute_702              1 1 576 577 0=2
MatMul                   bmm_479                  2 1 535 577 578
Permute                  permute_703              1 1 578 579 0=2
Reshape                  reshape_325              1 1 579 580 0=48 1=8
InnerProduct             linear_189               1 1 580 581 0=160 1=1 2=7680
BinaryOp                 add_72                   2 1 570 581 582 0=0
Split                    splitncnn_94             1 2 582 583 584
Permute                  permute_546              1 1 584 585 0=1
Convolution1D            conv1d_114               1 1 585 586 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_5                    1 1 586 587 0=0
Concat                   cat_14                   2 1 486 587 588 0=1
Split                    splitncnn_95             1 2 588 589 590
ConvolutionDepthWise1D   convdw1d_814             1 1 590 591 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_96             1 2 591 592 593
BinaryOp                 sub_73                   1 1 592 594 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 594 595
BinaryOp                 mul_74                   2 1 593 595 596 0=2
Convolution1D            conv1d_115               1 1 596 597 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_547              1 1 597 598 0=1
BinaryOp                 add_75                   2 1 583 598 599 0=0
Split                    splitncnn_97             1 2 599 600 601
InnerProduct             linear_190               1 1 601 602 0=320 1=1 2=51200
Split                    splitncnn_98             1 2 602 603 604
BinaryOp                 sub_76                   1 1 603 605 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 605 606
BinaryOp                 mul_77                   2 1 604 606 607 0=2
InnerProduct             linear_191               1 1 607 608 0=160 1=1 2=51200
BinaryOp                 add_78                   2 1 600 608 609 0=0
Split                    splitncnn_99             1 3 609 610 611 612
BinaryOp                 mul_79                   2 1 610 611 613 0=2
Reduction                mean_524                 1 1 613 614 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_80                   1 1 614 615 0=0 1=1 2=3.792164e+00
BinaryOp                 pow_81                   1 1 615 616 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_82                   2 1 612 616 617 0=2
BinaryOp                 sub_83                   2 1 617 488 618 0=1
BinaryOp                 mul_84                   2 1 618 136 619 0=2
BinaryOp                 add_85                   2 1 489 619 620 0=0
Split                    splitncnn_100            1 4 620 621 622 623 624
Crop                     crop_617                 1 1 6 625 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 625 626 0=0 1=0
Crop                     crop_618                 1 1 23 627 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_50_ncnnreshape0 1 1 627 628 0=0 1=0
Crop                     crop_619                 1 1 40 629 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_51_ncnnreshape0 1 1 629 630 0=0 1=0
Crop                     crop_620                 1 1 57 631 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_52_ncnnreshape0 1 1 631 632 0=0 1=0
Crop                     crop_621                 1 1 74 633 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_53_ncnnreshape0 1 1 633 634 0=0 1=0
Crop                     crop_622                 1 1 91 635 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_54_ncnnreshape0 1 1 635 636 0=0 1=0
Crop                     crop_623                 1 1 108 637 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_55_ncnnreshape0 1 1 637 638 0=0 1=0
InnerProduct             linear_192               1 1 624 639 0=320 1=1 2=51200
Split                    splitncnn_101            1 2 639 640 641
BinaryOp                 sub_86                   1 1 640 642 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 642 643
BinaryOp                 mul_87                   2 1 641 643 644 0=2
InnerProduct             linear_193               1 1 644 645 0=160 1=1 2=51200
BinaryOp                 add_88                   2 1 621 645 646 0=0
Split                    splitncnn_102            1 2 646 647 648
PoolingModuleNoProj      pooling_modul_no_proj_779 3 3 648 626 628 649 650 651
InnerProduct             linear_194               1 1 649 652 0=160 1=0 2=25600
BinaryOp                 add_89                   2 1 647 652 653 0=0
Split                    splitncnn_103            1 2 653 654 655
InnerProduct             linear_195               1 1 655 656 0=256 1=1 2=40960
Slice                    tensor_split_3           1 4 656 657 658 659 660 -23300=4,96,96,48,-233 1=1
Concat                   cat_15                   2 1 632 659 661 0=0
Split                    splitncnn_104            1 2 661 662 663
Reshape                  reshape_326              1 1 662 664 0=12 1=4 2=40
Reshape                  reshape_327              1 1 657 665 0=24 1=4 2=8
Reshape                  reshape_328              1 1 660 666 0=4 1=4 2=8
Concat                   cat_16                   2 1 630 658 667 0=0
Split                    splitncnn_105            1 2 667 668 669
Reshape                  reshape_329              1 1 668 670 0=24 1=4 2=40
InnerProduct             linear_196               1 1 139 671 0=16 1=0 2=2560
Reshape                  reshape_330              1 1 671 672 0=4 1=4 2=47
Permute                  permute_708              1 1 672 673 0=3
Permute                  permute_706              1 1 666 674 0=2
MatMul                   matmul_504               2 1 674 673 675
Permute                  permute_707              1 1 670 676 0=3
Permute                  permute_705              1 1 665 677 0=2
MatMul                   matmul_505               2 1 677 676 678
TensorAsStrided          tensor_as_strided_791    1 1 675 679 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_90                   2 1 678 679 680 0=0
Reshape                  view_465                 1 1 680 681 0=40 1=8 2=4
Softmax                  softmax_91               1 1 681 682 0=-1 1=1
Split                    splitncnn_106            1 2 682 683 684
Permute                  permute_704              1 1 664 685 0=2
MatMul                   bmm_480                  2 1 684 685 686
Permute                  permute_709              1 1 686 687 0=2
Reshape                  reshape_331              1 1 687 688 0=48 1=8
InnerProduct             linear_197               1 1 688 689 0=160 1=1 2=7680
BinaryOp                 add_91                   2 1 654 689 690 0=0
Split                    splitncnn_107            1 2 690 691 692
Permute                  permute_548              1 1 692 693 0=1
Convolution1D            conv1d_116               1 1 693 694 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_6                    1 1 694 695 0=0
Concat                   cat_17                   2 1 636 695 696 0=1
Split                    splitncnn_108            1 2 696 697 698
ConvolutionDepthWise1D   convdw1d_815             1 1 698 699 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_109            1 2 699 700 701
BinaryOp                 sub_92                   1 1 700 702 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 702 703
BinaryOp                 mul_93                   2 1 701 703 704 0=2
Convolution1D            conv1d_117               1 1 704 705 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_549              1 1 705 706 0=1
BinaryOp                 add_94                   2 1 691 706 707 0=0
Split                    splitncnn_110            1 2 707 708 709
InnerProduct             linear_198               1 1 709 710 0=320 1=1 2=51200
Split                    splitncnn_111            1 2 710 711 712
BinaryOp                 sub_95                   1 1 711 713 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_44               1 1 713 714
BinaryOp                 mul_96                   2 1 712 714 715 0=2
InnerProduct             linear_199               1 1 715 716 0=160 1=1 2=51200
BinaryOp                 add_97                   2 1 708 716 717 0=0
Split                    splitncnn_112            1 2 717 718 719
InnerProduct             linear_200               1 1 719 720 0=48 1=0 2=7680
Concat                   cat_18                   2 1 634 720 721 0=0
Split                    splitncnn_113            1 2 721 722 723
Reshape                  reshape_332              1 1 722 724 0=12 1=4 2=40
Permute                  permute_710              1 1 724 725 0=2
MatMul                   bmm_481                  2 1 683 725 726
Permute                  permute_711              1 1 726 727 0=2
Reshape                  reshape_333              1 1 727 728 0=48 1=8
InnerProduct             linear_201               1 1 728 729 0=160 1=1 2=7680
BinaryOp                 add_98                   2 1 718 729 730 0=0
Split                    splitncnn_114            1 2 730 731 732
Permute                  permute_550              1 1 732 733 0=1
Convolution1D            conv1d_118               1 1 733 734 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_7                    1 1 734 735 0=0
Concat                   cat_19                   2 1 638 735 736 0=1
Split                    splitncnn_115            1 2 736 737 738
ConvolutionDepthWise1D   convdw1d_816             1 1 738 739 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_116            1 2 739 740 741
BinaryOp                 sub_99                   1 1 740 742 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_45               1 1 742 743
BinaryOp                 mul_100                  2 1 741 743 744 0=2
Convolution1D            conv1d_119               1 1 744 745 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_551              1 1 745 746 0=1
BinaryOp                 add_101                  2 1 731 746 747 0=0
Split                    splitncnn_117            1 2 747 748 749
InnerProduct             linear_202               1 1 749 750 0=320 1=1 2=51200
Split                    splitncnn_118            1 2 750 751 752
BinaryOp                 sub_102                  1 1 751 753 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_46               1 1 753 754
BinaryOp                 mul_103                  2 1 752 754 755 0=2
InnerProduct             linear_203               1 1 755 756 0=160 1=1 2=51200
BinaryOp                 add_104                  2 1 748 756 757 0=0
Split                    splitncnn_119            1 3 757 758 759 760
BinaryOp                 mul_105                  2 1 758 759 761 0=2
Reduction                mean_525                 1 1 761 762 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_106                  1 1 762 763 0=0 1=1 2=5.184794e+00
BinaryOp                 pow_107                  1 1 763 764 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_108                  2 1 760 764 765 0=2
BinaryOp                 sub_109                  2 1 765 622 766 0=1
BinaryOp                 mul_110                  2 1 766 135 767 0=2
BinaryOp                 add_111                  2 1 623 767 768 0=0
Split                    splitncnn_120            1 4 768 769 770 771 772
Crop                     crop_624                 1 1 5 773 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  encoders.1.encoder.state_select_list.2_ncnnreshape0 1 1 773 774 0=0 1=0
Crop                     crop_625                 1 1 22 775 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_63_ncnnreshape0 1 1 775 776 0=0 1=0
Crop                     crop_626                 1 1 39 777 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_64_ncnnreshape0 1 1 777 778 0=0 1=0
Crop                     crop_627                 1 1 56 779 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_65_ncnnreshape0 1 1 779 780 0=0 1=0
Crop                     crop_628                 1 1 73 781 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_66_ncnnreshape0 1 1 781 782 0=0 1=0
Crop                     crop_629                 1 1 90 783 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_67_ncnnreshape0 1 1 783 784 0=0 1=0
Crop                     crop_630                 1 1 107 785 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_68_ncnnreshape0 1 1 785 786 0=0 1=0
InnerProduct             linear_204               1 1 772 787 0=320 1=1 2=51200
Split                    splitncnn_121            1 2 787 788 789
BinaryOp                 sub_112                  1 1 788 790 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_47               1 1 790 791
BinaryOp                 mul_113                  2 1 789 791 792 0=2
InnerProduct             linear_205               1 1 792 793 0=160 1=1 2=51200
BinaryOp                 add_114                  2 1 769 793 794 0=0
Split                    splitncnn_122            1 2 794 795 796
PoolingModuleNoProj      pooling_modul_no_proj_780 3 3 796 774 776 797 798 799
InnerProduct             linear_206               1 1 797 800 0=160 1=0 2=25600
BinaryOp                 add_115                  2 1 795 800 801 0=0
Split                    splitncnn_123            1 2 801 802 803
InnerProduct             linear_207               1 1 803 804 0=256 1=1 2=40960
Slice                    tensor_split_4           1 4 804 805 806 807 808 -23300=4,96,96,48,-233 1=1
Concat                   cat_20                   2 1 780 807 809 0=0
Split                    splitncnn_124            1 2 809 810 811
Reshape                  reshape_334              1 1 810 812 0=12 1=4 2=40
Reshape                  reshape_335              1 1 805 813 0=24 1=4 2=8
Reshape                  reshape_336              1 1 808 814 0=4 1=4 2=8
Concat                   cat_21                   2 1 778 806 815 0=0
Split                    splitncnn_125            1 2 815 816 817
Reshape                  reshape_337              1 1 816 818 0=24 1=4 2=40
InnerProduct             linear_208               1 1 138 819 0=16 1=0 2=2560
Reshape                  reshape_338              1 1 819 820 0=4 1=4 2=47
Permute                  permute_716              1 1 820 821 0=3
Permute                  permute_714              1 1 814 822 0=2
MatMul                   matmul_506               2 1 822 821 823
Permute                  permute_715              1 1 818 824 0=3
Permute                  permute_713              1 1 813 825 0=2
MatMul                   matmul_507               2 1 825 824 826
TensorAsStrided          tensor_as_strided_792    1 1 823 827 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_116                  2 1 826 827 828 0=0
Reshape                  view_466                 1 1 828 829 0=40 1=8 2=4
Softmax                  softmax_92               1 1 829 830 0=-1 1=1
Split                    splitncnn_126            1 2 830 831 832
Permute                  permute_712              1 1 812 833 0=2
MatMul                   bmm_482                  2 1 832 833 834
Permute                  permute_717              1 1 834 835 0=2
Reshape                  reshape_339              1 1 835 836 0=48 1=8
InnerProduct             linear_209               1 1 836 837 0=160 1=1 2=7680
BinaryOp                 add_117                  2 1 802 837 838 0=0
Split                    splitncnn_127            1 2 838 839 840
Permute                  permute_552              1 1 840 841 0=1
Convolution1D            conv1d_120               1 1 841 842 0=320 1=1 2=1 3=1 4=0 5=1 6=51200
GLU                      glu_8                    1 1 842 843 0=0
Concat                   cat_22                   2 1 784 843 844 0=1
Split                    splitncnn_128            1 2 844 845 846
ConvolutionDepthWise1D   convdw1d_817             1 1 846 847 0=160 1=31 2=1 3=1 4=0 5=1 6=4960 7=160
Split                    splitncnn_129            1 2 847 848 849
BinaryOp                 sub_118                  1 1 848 850 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_48               1 1 850 851
BinaryOp                 mul_119                  2 1 849 851 852 0=2
Convolution1D            conv1d_121               1 1 852 853 0=160 1=1 2=1 3=1 4=0 5=1 6=25600
Permute                  permute_553              1 1 853 854 0=1
BinaryOp                 add_120                  2 1 839 854 855 0=0
Split                    splitncnn_130            1 2 855 856 857
InnerProduct             linear_210               1 1 857 858 0=320 1=1 2=51200
Split                    splitncnn_131            1 2 858 859 860
BinaryOp                 sub_121                  1 1 859 861 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_49               1 1 861 862
BinaryOp                 mul_122                  2 1 860 862 863 0=2
